from tkinter import *
import random
from datetime import datetime
import time


home = 0

def zodiac():
    import datetime
    global rasee
    global rsrs
    global monthn
    global dayn
    global yearn
    global age
    global blood
    global rsbd
    global day 
    global rsdy
    b = monthn
    a = dayn 
    now = datetime.datetime.now()
    num=now.year
    mont=now.month
    dd=now.day
    age=num-yearn
    if(mont<monthn):
        age-=1
    elif(mont==monthn):
        if(dd<dayn):
            age-=1
        else:
            age=age
    else:
        age=age


    if(b == 1):
        if(a >= 15):
            rasee="ราศีมังกร"
            rsrs = "การเงิน\nสถานะการเงินยังพอประคับประคองกันไปได้   รายได้ยังมีเข้ามาปกติ   เพียงแต่ช่วงมกราคมนี้หลายคนจะมี\nเรื่องให้ใช้จ่ายที่จำเป็นเข้ามาหลายอย่าง เช่น ลงทุนขยับขยายธุรกิจ หรือปรับปรุงซ่อมแซม ลักษณะเหล่านี้ยัง\nบริหารจัดการได้เป็นอย่างดี แต่ถ้าจะนำเงินไปลงทุนในแบบเสี่ยงๆ หวังรายทางลัด  หรือไม่ศึกษารายละเอียด\nให้รอบคอบก่อน คงต้องระวัง! มีโอกาสถูกหลอกถูกโกงและอาจไม่ได้ผลตอบแทนตามเป้าหมายที่ตั้งไว้\nการงาน\nต้องเตือน! มีเกณฑ์เกิดความวุ่นวาย มีปัญหาอุปสรรคเข้ามาให้แก้ไขแทบทุกวัน ช่วงนี้ระวัง!เรื่องอารมณ์และ\nการตัดสินใจให้มากขึ้น อีกทั้งความเครียด ความกดดันที่จะตามมากระทบร่างกายและจิตใจ แนะนำให้ทำงาน\nแบบไม่ต้องออกหน้ามากเกินไป  เพราะดวงการเจรจาค่อนข้างจะมีปัญหา   มีโอกาสที่พูดไปแล้วจะทำให้เกิด\nความไม่เข้าใจกันได้ง่าย รวมถึงเรื่องของเอกสารสัญญาก็จะมีโอกาสผิดพลาดได้เช่นกัน\nความรัก\nจังหวะดวงช่วงนี้ยังไม่เหมาะกับการเริ่มต้นความสัมพันธ์ครั้งใหม่ คนโสดจึงไม่ควรรีบร้อนกับความรักที่เข้ามา\nแนะนำให้ศึกษากันไปก่อนหรือทุ่มเทเวลากับเรื่องอื่นๆ  ไปก่อน  สำหรับคนที่มีคู่มีแฟนแล้ว ดวงดาวไม่เป็นใจ\nในความรัก กลับส่งผลให้มีปากเสียงกันได้ง่าย บางเรื่องอาจจะพาลด้วยอารมณ์มากกว่าเหตุผล จึงต้องระวัง!\nการตัดสินใจ บางทีการไม่มีเวลามาเจอกันอาจจะส่งผลที่ดีกว่า เพื่อจะได้ไม่ต้องเจอกัน แล้ว มาทะเลาะกัน"
        else:
            rasee="ราศีธนู"
            rsrs = "การเงิน\nข่าวดี! การเงินจะเริ่มกลับมาตั้งหลักได้ตั้งแต่ช่วงมกราคมนี้เลย หลังจากที่ชาวราศีธนูมืดแปดด้านกับการเงิน\nที่ติดขัดมานาน ช่วงนี้การเงินจะมีความมั่นคงมากขึ้น ทั้งรายได้ สวัสดิการจะดีขึ้น หรือใครที่ค้าขาย ทำธุรกิจ\nของตัวเองจะมีโอกาสประสบความสำเร็จในเรื่องเงินทอง ค้าขายดีมีกำไรและบางคนอาจจะมีเหลือเก็บออม \nนำไปเคลียร์หนี้สินให้เบาลงได้อีกด้วย\nการงาน\nจังหวะดวงค่อนข้างคึกคัก มีความก้าวหน้ามากขึ้น ปัญหาความวุ่นวายต่างๆ ที่เคยเข้ามาจะคลี่คลายดีขึ้น มี\nโอกาสได้รับความช่วยเหลือจากคนรอบข้างหรือผู้ใหญ่เจ้านายมากขึ้น รวมถึงความช่วยเหลือต่างๆอยู่ใน\nเกณฑ์ที่ดีเช่นกัน นอกจากนี้การทำธุรกิจค้าขายจะมีลูกค้าใหม่ๆ มากขึ้น มีหนทางได้ขยับขยายสินค้าหรือ\nสาขาเพิ่มเติมได้อีกด้วย\nความรัก\nยกให้ราศีธนูเป็นราศีที่มีเสน่ห์มาก มีผลให้คนโสดหลายคนจะได้มีคู่มีแฟนบ้างแล้ว ด้วยดวงดาวแห่งความ\nมีเสน่ห์ที่เข้ามานั้นจะทำให้ความรักโดดเด่น  และมีโอกาสได้เริ่มต้นความสัมพันธ์ครั้งใหม่ ๆ  มีตัวช่วยที่ดี\nทั้งญาติพี่น้องหรือเพื่อนฝูงเป็นกองเชียร์แนะนำคนใหม่ๆ ให้รู้จัก สำหรับคนที่มีคู่มีแฟนแล้ว ยังคงมีความ\nสัมพันธ์ที่ลงตัว เพียงแต่ต้องหาเวลาอยู่ร่วมกันให้มากขึ้น เพื่อกระชับความสัมพันธ์ให้แน่นแฟ้น"
    elif(b == 2):
        if(a >= 13):
            rasee="ราศีกุมภ์"
            rsrs = "การเงิน\nมีเกณฑ์โชคลาภแบบไม่คาดฝันที่โดดเด่นเข้ามาต้อนรับปีใหม่  มีโอกาสที่ดี  ทั้งโชคจากการถูกรางวัลหรือโชค\nจากการได้ของฝากของกำนัล ได้ของขวัญที่ถูกใจ สำหรับรายได้อื่นๆ ที่เป็นตัวเงิน คงต้องรอสักระยะ ช่วงนี้จะ\nมีข่าวดีเข้ามาให้ชื่นใจก่อน   ทั้งนี้รายได้นั้นอาจจะมาจากการลงทุนในอดีต  หรือส่วนแบ่งจากการทำงานต่างๆ \nหลังจากนี้รอรับเงินกันได้เลย\nการงาน\nหน้าที่การงานจะได้พัฒนาก้าวไปอีกขั้น  ถ้าวางแผนทำกิจการของตัวเอง  หรือทำการค้าขาย  เปิดตัวทำสินค้า\nใหม่ๆ มีโอกาสจะได้การตอบรับที่ดี แถมยังมีเพื่อนฝูงจะคอยช่วยเหลือสนับสนุนเป็นอย่างดีอีกด้วย แต่ช่วงนี้\nต้องระวังความเครียดวิตกกังวลไว้บ้าง เพราะมีหลายเรื่องเข้ามาในเวลาเดียวกัน ต้องคิด  ต้องแก้ไข  หรือมีข้อ\nผิดพลาดเกิดขึ้นในการทำงาน ลักษณะเหล่านี้คงต้องใช้ความรอบคอบกับการทำงานให้มากขึ้น\nความรัก\nดวงดาวส่งเสริมให้คนโสดมีโอกาสได้พบรักครั้งใหม่แบบไม่ทันตั้งตัว ถ้าไม่พร้อมมีความรักในช่วงนี้ ไม่ต้อง\nรีบร้อนตัดสินใจก็ได้  ค่อยๆ  ดูกันไปจะดีที่สุด  เพราะยังมีจังหวะอีกหลายครั้งหลังจากนี้ สำหรับคนมีคู่มีแฟน\nแล้วต้องระวัง!เรื่องคำพูดให้มากขึ้น บางทีคำพูดเล็กน้อยอาจจะทำให้เกิดปัญหาน้อยใจกันหรือลุกลามกลายเป็น\nปัญหาอื่นๆ ตามมาได้"
        else:
            rasee="ราศีมังกร"
            rsrs = "การเงิน\nสถานะการเงินยังพอประคับประคองกันไปได้   รายได้ยังมีเข้ามาปกติ   เพียงแต่ช่วงมกราคมนี้หลายคนจะมี\nเรื่องให้ใช้จ่ายที่จำเป็นเข้ามาหลายอย่าง เช่น ลงทุนขยับขยายธุรกิจ หรือปรับปรุงซ่อมแซม ลักษณะเหล่านี้ยัง\nบริหารจัดการได้เป็นอย่างดี แต่ถ้าจะนำเงินไปลงทุนในแบบเสี่ยงๆ หวังรายทางลัด  หรือไม่ศึกษารายละเอียด\nให้รอบคอบก่อน คงต้องระวัง! มีโอกาสถูกหลอกถูกโกงและอาจไม่ได้ผลตอบแทนตามเป้าหมายที่ตั้งไว้\nการงาน\nต้องเตือน! มีเกณฑ์เกิดความวุ่นวาย มีปัญหาอุปสรรคเข้ามาให้แก้ไขแทบทุกวัน ช่วงนี้ระวัง!เรื่องอารมณ์และ\nการตัดสินใจให้มากขึ้น อีกทั้งความเครียด ความกดดันที่จะตามมากระทบร่างกายและจิตใจ แนะนำให้ทำงาน\nแบบไม่ต้องออกหน้ามากเกินไป  เพราะดวงการเจรจาค่อนข้างจะมีปัญหา   มีโอกาสที่พูดไปแล้วจะทำให้เกิด\nความไม่เข้าใจกันได้ง่าย รวมถึงเรื่องของเอกสารสัญญาก็จะมีโอกาสผิดพลาดได้เช่นกัน\nความรัก\nจังหวะดวงช่วงนี้ยังไม่เหมาะกับการเริ่มต้นความสัมพันธ์ครั้งใหม่ คนโสดจึงไม่ควรรีบร้อนกับความรักที่เข้ามา\nแนะนำให้ศึกษากันไปก่อนหรือทุ่มเทเวลากับเรื่องอื่นๆ  ไปก่อน  สำหรับคนที่มีคู่มีแฟนแล้ว ดวงดาวไม่เป็นใจ\nในความรัก กลับส่งผลให้มีปากเสียงกันได้ง่าย บางเรื่องอาจจะพาลด้วยอารมณ์มากกว่าเหตุผล จึงต้องระวัง!\nการตัดสินใจ บางทีการไม่มีเวลามาเจอกันอาจจะส่งผลที่ดีกว่า เพื่อจะได้ไม่ต้องเจอกัน แล้ว มาทะเลาะกัน"
    elif(b == 3):
        if(a >= 15):
            rasee="ราศีมีน"
            rsrs = "การเงิน\nข่าวดีมาแล้ว! มกราคมนี้ดวงปัง มีตังใช้ไปตลอดทั้งเดือน เพราะจะมีรายได้เพิ่มเติมเข้ามาทำให้เกิดสภาพคล่อง\nมากขึ้น บางคนอาจได้ทำหลายอาชีพเสริม บางทีเงินพิเศษอาจจะได้มากกว่าเงินจากงานประจำด้วยซ้ำไป  บวก\nกับยังมีดวงโชคลาภที่โดดเด่นอีกด้วย เพียงแต่ช่วงนี้จะมีรายจ่ายที่สำคัญเกี่ยวกับการซ่อมแซมยวดยานพาหนะ\nเข้ามา คงต้องบริหารจัดการเงินทองกันให้ดีและเก็บออมไว้เผื่อฉุกเฉินบ้าง\nการงาน\nจังหวะดวงมีความคึกคัก ดวงการงานถือว่ากำลังไปได้ดี ลักษณะงานที่เด่นในช่วงนี้ คืองานค้าขายออนไลน์ การ\nติดต่อเจรจาทางไกล เป็นงานที่จะทำให้ชาวราศีมีนมีความสำเร็จก้าวหน้ามากเป็นพิเศษ  ในดวงอาจต้องเหนื่อย\nมากขึ้น มีความยุ่งวุ่นวายมากขึ้น  ทั้งต้องดูแลงานของตัวเองและดูแลงานแทนคนอื่น   สำหรับคนที่เป็นเจ้าของ\nธุรกิจ ดวงลักษณะนี้กลับส่งผลดี ซึ่งนั่นจะหมายถึง ยอดขายที่เพิ่มขึ้น มีตัวเลขในการค้าขายที่ดีขึ้นเข้ามานั่นเอง\nความรัก\nจังหวะของความรักและการทำงานจะมาควบคู่กันในช่วงนี้ คนโสดจึงมีโอกาสได้พบกับคนที่ถูกใจในระหว่าง\nการทำงานก็ได้ หรือเจอคนในอาชีพแวดวงเดียวกัน ลักษณะนี้ถือว่าเป็นโอกาสที่ดีในการได้พบเจอคนใหม่ๆ \nสำหรับคนที่มีคู่มีแฟนแล้ว ดวงคู่ครองเกื้อหนุนเป็นอย่างดี  คู่ของคุณจะช่วยให้ชีวิตเกิดความสำเร็จก้าวหน้า\nและมีชีวิตคู่ที่มั่นคงลงตัว"
        else:
            rasee="ราศีกุมภ์"
            rsrs = "การเงิน\nมีเกณฑ์โชคลาภแบบไม่คาดฝันที่โดดเด่นเข้ามาต้อนรับปีใหม่  มีโอกาสที่ดี  ทั้งโชคจากการถูกรางวัลหรือโชค\nจากการได้ของฝากของกำนัล ได้ของขวัญที่ถูกใจ สำหรับรายได้อื่นๆ ที่เป็นตัวเงิน คงต้องรอสักระยะ ช่วงนี้จะ\nมีข่าวดีเข้ามาให้ชื่นใจก่อน   ทั้งนี้รายได้นั้นอาจจะมาจากการลงทุนในอดีต  หรือส่วนแบ่งจากการทำงานต่างๆ \nหลังจากนี้รอรับเงินกันได้เลย\nการงาน\nหน้าที่การงานจะได้พัฒนาก้าวไปอีกขั้น  ถ้าวางแผนทำกิจการของตัวเอง  หรือทำการค้าขาย  เปิดตัวทำสินค้า\nใหม่ๆ มีโอกาสจะได้การตอบรับที่ดี แถมยังมีเพื่อนฝูงจะคอยช่วยเหลือสนับสนุนเป็นอย่างดีอีกด้วย แต่ช่วงนี้\nต้องระวังความเครียดวิตกกังวลไว้บ้าง เพราะมีหลายเรื่องเข้ามาในเวลาเดียวกัน ต้องคิด  ต้องแก้ไข  หรือมีข้อ\nผิดพลาดเกิดขึ้นในการทำงาน ลักษณะเหล่านี้คงต้องใช้ความรอบคอบกับการทำงานให้มากขึ้น\nความรัก\nดวงดาวส่งเสริมให้คนโสดมีโอกาสได้พบรักครั้งใหม่แบบไม่ทันตั้งตัว ถ้าไม่พร้อมมีความรักในช่วงนี้ ไม่ต้อง\nรีบร้อนตัดสินใจก็ได้  ค่อยๆ  ดูกันไปจะดีที่สุด  เพราะยังมีจังหวะอีกหลายครั้งหลังจากนี้ สำหรับคนมีคู่มีแฟน\nแล้วต้องระวัง!เรื่องคำพูดให้มากขึ้น บางทีคำพูดเล็กน้อยอาจจะทำให้เกิดปัญหาน้อยใจกันหรือลุกลามกลายเป็น\nปัญหาอื่นๆ ตามมาได้"
    elif(b == 4):
        if(a >= 14):
            rasee="ราศีเมษ"
            rsrs = "การเงิน\nยังคงมีความวุ่นวายทางสถานะการเงินต้อนรับปีใหม่ มีเรื่องเสียเงินเสียทองเข้ามาตลอดทั้งเดือนมกราคมนี้\nรายจ่ายหลายอย่างจะครบกำหนดจ่ายพร้อมกัน  แต่ในดวงชะตายังพอมีโชคลาภเข้ามาบ้าง มีโอกาสได้ลุ้น\nในสิ่งที่ไม่คิดฝันมาก่อน  เมื่อได้โชคลาภหรือเงินทองเข้ามาแล้ว  อย่าลืมแบ่งเงินนั้นไปทำบุญบริจาคทันที\nเพื่อป้องกันปัญหาทุกขลาภที่อาจตามมา\nการงาน\nมีเกณฑ์เริ่มต้นปีด้วยความราบรื่นลงตัว  ทั้งการโปรโมท  เลื่อนขั้นเลื่อนตำแหน่ง การเริ่มต้นงานใหม่ๆ ธุรกิจ\nใหม่ ๆ มีชื่อเสียง มีความสำเร็จเป็นรูปเป็นร่าง เมื่อดวงดีแล้วก็จะมีหลายสิ่งให้ต้องดูแลรับผิดชอบมากขึ้นตาม\nไปด้วย  ซึ่งจะมีความเหน็ดเหนื่อยตามมา  แต่ดวงแบบนี้เหนื่อยแล้วดี มีความก้าวหน้าในหน้าที่การงานตาม\nมาแน่นอน\nความรัก\nอยู่ในจุดที่ความรักอบอวลไปด้วยความสุข คนโสดเตรียมตัวต้อนรับข่าวดี ใครที่อยากจะเริ่มต้นใหม่ๆ ช่วงนี้\nจะมีโอกาสดีๆเข้ามา มีความรักที่มาจากทางไกล เดินทางมาเจอกัน หรือเจอกันทางออนไลน์ ลักษณะเหล่านี้\nมีลุ้นเป็นความสัมพันธ์ครั้งใหม่ ๆ  สำหรับคนที่มีคู่มีแฟนแล้ว  ความสัมพันธ์ยังมั่นคงแข็งแรง  ปัญหาหรือ\nความทุกข์ใจต่าง ๆ จะคลี่คลายไปในทิศทางที่ดีขึ้น" 
        else:
            rasee="ราศีมีน"
            rsrs = "การเงิน\nข่าวดีมาแล้ว! มกราคมนี้ดวงปัง มีตังใช้ไปตลอดทั้งเดือน เพราะจะมีรายได้เพิ่มเติมเข้ามาทำให้เกิดสภาพคล่อง\nมากขึ้น บางคนอาจได้ทำหลายอาชีพเสริม บางทีเงินพิเศษอาจจะได้มากกว่าเงินจากงานประจำด้วยซ้ำไป  บวก\nกับยังมีดวงโชคลาภที่โดดเด่นอีกด้วย เพียงแต่ช่วงนี้จะมีรายจ่ายที่สำคัญเกี่ยวกับการซ่อมแซมยวดยานพาหนะ\nเข้ามา คงต้องบริหารจัดการเงินทองกันให้ดีและเก็บออมไว้เผื่อฉุกเฉินบ้าง\nการงาน\nจังหวะดวงมีความคึกคัก ดวงการงานถือว่ากำลังไปได้ดี ลักษณะงานที่เด่นในช่วงนี้ คืองานค้าขายออนไลน์ การ\nติดต่อเจรจาทางไกล เป็นงานที่จะทำให้ชาวราศีมีนมีความสำเร็จก้าวหน้ามากเป็นพิเศษ  ในดวงอาจต้องเหนื่อย\nมากขึ้น มีความยุ่งวุ่นวายมากขึ้น  ทั้งต้องดูแลงานของตัวเองและดูแลงานแทนคนอื่น   สำหรับคนที่เป็นเจ้าของ\nธุรกิจ ดวงลักษณะนี้กลับส่งผลดี ซึ่งนั่นจะหมายถึง ยอดขายที่เพิ่มขึ้น มีตัวเลขในการค้าขายที่ดีขึ้นเข้ามานั่นเอง\nความรัก\nจังหวะของความรักและการทำงานจะมาควบคู่กันในช่วงนี้ คนโสดจึงมีโอกาสได้พบกับคนที่ถูกใจในระหว่าง\nการทำงานก็ได้ หรือเจอคนในอาชีพแวดวงเดียวกัน ลักษณะนี้ถือว่าเป็นโอกาสที่ดีในการได้พบเจอคนใหม่ๆ \nสำหรับคนที่มีคู่มีแฟนแล้ว ดวงคู่ครองเกื้อหนุนเป็นอย่างดี  คู่ของคุณจะช่วยให้ชีวิตเกิดความสำเร็จก้าวหน้า\nและมีชีวิตคู่ที่มั่นคงลงตัว"
    elif(b == 5):
        if(a >= 15):
            rasee="ราศีพฤษภ"
            rsrs = "การเงิน\nเปิดประเดิมด้วยความแรงของดวงชะตา  ดวงรายจ่ายนั้นหนักหนาสาหัสเหมือนเป็นราศีที่กระเป๋าสตางค์รั่ว\nมีเกณฑ์เสียเงินกับหลายภาระ ทั้งเรื่องสุขภาพ รายจ่ายในบ้าน การซ่อมแซมข้าวของเครื่องใช้ต่างๆ กระแส\nดวงมีความผันผวน  บางช่วงหมุนเงินเยอะ  บางช่วงก็ยังมีโชคลาภเข้าบ้างเช่นกัน  มีโอกาสได้รับโชคเข้ามา\nอย่างไม่คาดฝัน แนะนำให้แบ่งเงินแบ่งโชคนั้นไปทำบุญบริจาค เพื่อแก้เคล็ดดวงเสียเงินให้น้อยลง\nการงาน\nจังหวะดวงมีความแรง ยิ่งถ้าเป็นพนักงานประจำ มนุษย์เงินเดือน ยิ่งต้องระวังการเปลี่ยนแปลง การถูกปรับ\nเปลี่ยน ถูกยกเลิก อย่างกะทันหันแบบไม่ทันตั้งตัว หรืออาจจะได้ดูแลรับผิดชอบหลายหน้าที่ในเวลาเดียวกัน\nบางคนเกิดอาการเบื่อหน่ายกับงานเดิม ๆ   ที่ทำอยู่และอยากหางานใหม่   ซึ่งการหางานใหม่ในช่วงนี้ยังไม่\nแนะนำ เพราะกระแสดวงแรงอาจทำให้ตัดสินใจผิดพลาดได้\nความรัก\nอยู่ในช่วงที่ความแรงของดวงส่งผลต่อความรักเช่นกัน คนที่มีคู่มีแฟนแล้วมีเกณฑ์ทะเลาะมีปากเสียงกันด้วย\nเรื่องจุกจิกเล็กๆ น้อยๆ แนะนำให้หาเวลาว่างร่วมกันบ้างและพูดคุย"
        else:
            rasee="ราศีเมษ"
            rsrs = "การเงิน\nยังคงมีความวุ่นวายทางสถานะการเงินต้อนรับปีใหม่ มีเรื่องเสียเงินเสียทองเข้ามาตลอดทั้งเดือนมกราคมนี้\nรายจ่ายหลายอย่างจะครบกำหนดจ่ายพร้อมกัน  แต่ในดวงชะตายังพอมีโชคลาภเข้ามาบ้าง มีโอกาสได้ลุ้น\nในสิ่งที่ไม่คิดฝันมาก่อน  เมื่อได้โชคลาภหรือเงินทองเข้ามาแล้ว  อย่าลืมแบ่งเงินนั้นไปทำบุญบริจาคทันที\nเพื่อป้องกันปัญหาทุกขลาภที่อาจตามมา\nการงาน\nมีเกณฑ์เริ่มต้นปีด้วยความราบรื่นลงตัว  ทั้งการโปรโมท  เลื่อนขั้นเลื่อนตำแหน่ง การเริ่มต้นงานใหม่ๆ ธุรกิจ\nใหม่ ๆ มีชื่อเสียง มีความสำเร็จเป็นรูปเป็นร่าง เมื่อดวงดีแล้วก็จะมีหลายสิ่งให้ต้องดูแลรับผิดชอบมากขึ้นตาม\nไปด้วย  ซึ่งจะมีความเหน็ดเหนื่อยตามมา  แต่ดวงแบบนี้เหนื่อยแล้วดี มีความก้าวหน้าในหน้าที่การงานตาม\nมาแน่นอน\nความรัก\nอยู่ในจุดที่ความรักอบอวลไปด้วยความสุข คนโสดเตรียมตัวต้อนรับข่าวดี ใครที่อยากจะเริ่มต้นใหม่ๆ ช่วงนี้\nจะมีโอกาสดีๆเข้ามา มีความรักที่มาจากทางไกล เดินทางมาเจอกัน หรือเจอกันทางออนไลน์ ลักษณะเหล่านี้\nมีลุ้นเป็นความสัมพันธ์ครั้งใหม่ ๆ  สำหรับคนที่มีคู่มีแฟนแล้ว  ความสัมพันธ์ยังมั่นคงแข็งแรง  ปัญหาหรือ\nความทุกข์ใจต่าง ๆ จะคลี่คลายไปในทิศทางที่ดีขึ้น"
    elif(b == 6):
        if(a >= 15):
            rasee="ราศีเมถุน"
            rsrs = "การเงิน\nจังหวะดวงมีความวุ่นวายหนักหน่วง มีเกณฑ์ความติดขัดทางการเงินเข้ามา การหาเงินหารายได้ในช่วงนี้ค่อน\nข้างยาก  หรืออาจจะได้เงินมาแบบไม่เต็มเม็ดเต็มหน่วย  อีกทั้งยังมีเกณฑ์เสียเงินกับเรื่องที่ไม่จำเป็นอีกด้วย \nเช่น ค่าปรับ ค่าธรรมเนียมต่างๆ สำหรับเรื่องของโชคลาภ ถือว่ายังพอมีเข้ามาบ้าง แต่จะเป็นรูปแบบของฝาก \nของขวัญมากกว่าโชคที่เป็นตัวเงิน\nการงาน\nจังหวะดวงไม่เป็นใจ  มีผลให้พลังใจและพลังกายลดน้อยลง  หมดไฟกับการทำงาน  บางคนมีหลายเรื่องทำให้\nไม่สบายใจ ถูกนินทาใส่ร้ายหรือรู้สึกเบื่อหน่ายกับงานที่ทำอยู่ นอกจากนี้ต้องเตือน!ให้ระวังเรื่องเอกสารสัญญา\nการเจรจาให้มากขึ้นด้วย ช่วงนี้มีโอกาสผิดพลาดได้ง่ายกว่าปกติ แต่ข้อดีของดวง คือ ยังมีคอนเน็กชั่นที่ดี การ\nติดต่อ การขอความช่วยเหลือจากคนรอบข้างอยู่ในเกณฑ์ที่ดีมาก\nความรัก\nอยู่ในเกณฑ์ที่ไม่นิ่ง คนโสดที่กำลังเปิดใจคบหากันอยู่ อีกฝ่ายอาจยังมีความไม่ชัดเจน หรือมีความไม่แน่ใจ\nอยู่บ้าง ลักษณะนี้ต้องใช้เวลาศึกษากันไปยาวๆ สำหรับคนที่มีคู่มีแฟนแล้ว ยังดูแลความสัมพันธ์ของกันและ\nกันได้ดี หรืออาจจะมีเซอร์ไพรสที่ดีต่อกันมากขึ้นต้อนรับปีใหม่"
        else:
            rasee="ราศีพฤษภ"
            rsrs = "การเงิน\nเปิดประเดิมด้วยความแรงของดวงชะตา  ดวงรายจ่ายนั้นหนักหนาสาหัสเหมือนเป็นราศีที่กระเป๋าสตางค์รั่ว\nมีเกณฑ์เสียเงินกับหลายภาระ ทั้งเรื่องสุขภาพ รายจ่ายในบ้าน การซ่อมแซมข้าวของเครื่องใช้ต่างๆ กระแส\nดวงมีความผันผวน  บางช่วงหมุนเงินเยอะ  บางช่วงก็ยังมีโชคลาภเข้าบ้างเช่นกัน  มีโอกาสได้รับโชคเข้ามา\nอย่างไม่คาดฝัน แนะนำให้แบ่งเงินแบ่งโชคนั้นไปทำบุญบริจาค เพื่อแก้เคล็ดดวงเสียเงินให้น้อยลง\nการงาน\nจังหวะดวงมีความแรง ยิ่งถ้าเป็นพนักงานประจำ มนุษย์เงินเดือน ยิ่งต้องระวังการเปลี่ยนแปลง การถูกปรับ\nเปลี่ยน ถูกยกเลิก อย่างกะทันหันแบบไม่ทันตั้งตัว หรืออาจจะได้ดูแลรับผิดชอบหลายหน้าที่ในเวลาเดียวกัน\nบางคนเกิดอาการเบื่อหน่ายกับงานเดิม ๆ   ที่ทำอยู่และอยากหางานใหม่   ซึ่งการหางานใหม่ในช่วงนี้ยังไม่\nแนะนำ เพราะกระแสดวงแรงอาจทำให้ตัดสินใจผิดพลาดได้\nความรัก\nอยู่ในช่วงที่ความแรงของดวงส่งผลต่อความรักเช่นกัน คนที่มีคู่มีแฟนแล้วมีเกณฑ์ทะเลาะมีปากเสียงกันด้วย\nเรื่องจุกจิกเล็กๆ น้อยๆ แนะนำให้หาเวลาว่างร่วมกันบ้างและพูดคุย"
    elif(b == 7):
        if(a >= 17):
            rasee="ราศีกรกฎ"
            rsrs = "การเงิน\nสถานะการเงินฝืดเคืองต้อนรับปีใหม่ หาเงินหารายได้ค่อนข้างยาก บวกกับยังมีรายจ่ายในหนี้สินต่างๆรออยู่\nหลายอย่าง  ช่วงนี้อยากให้ระวัง!  การถูกหลอกถูกโกงไว้ด้วย  พยายามอย่าไว้ใจใครง่ายๆและระวังการทำ\nสัญญาการทำธุรกรรมอย่างรอบคอบด้วย ในขณะที่ดวงโชคลาภยังไม่โดดเด่น จึงไม่ควรทุ่มเทเงินทองกับ\nการเสี่ยงทุกประเภท\nการงาน\nมีเกณฑ์จะได้รับมอบหมายหลายหน้าที่ มีงานใหม่ๆ เข้ามาให้บริหารจัดการ บางคนยังมีโอกาสได้เปลี่ยนงาน\nใหม่อีกด้วย หรือบางคนจะได้เพื่อนร่วมงานใหม่ๆ เข้ามา ถ้าเป็นเจ้าของร้าน เจ้าของธุรกิจจะมีลูกค้าใหม่ ๆ\nหรือมีหุ้นส่วนใหม่เข้ามาด้วยเช่นกัน  เพียงแต่สิ่งใหม่ ๆ ที่เข้ามานั้นอาจจะมาพร้อมกับความวุ่นวายอยู่บ้าง \nและความเหน็ดเหนื่อยในการทำงานยังมีอยู่ ซึ่งยังไม่ได้หายไปไหน\nความรัก\nจังหวะดวงช่วงนี้ยังไม่เหมาะที่คนโสดจะเปิดใจคบหาใครจริงจัง เพราะลำพังแค่เรื่องงานในช่วงนี้ก็หนักหนา\nสาหัสแล้ว ถ้ามีความรักเข้ามาให้ปวดหัวอีก น่าจะไปไม่รอด หรือบางคู่ที่ลองคบหากันอยู่ อาจจะได้เจอกับ\nนิสัยที่แท้จริงของกันและกัน ทำให้ไปต่อได้ลำบาก ลักษณะนี้ต้องใช้เวลาดูไปก่อน สำหรับคนที่มีคู่มีแฟน\nแล้ว มีเกณฑ์กระทบกระทั่งกันอยู่บ่อย ๆ แต่โดยรวมแล้วยังไม่ร้ายแรง ยังคงมีความสัมพันธ์ที่ดีต่อกัน"
        else:
            rasee="ราศีเมถุน"
            rsrs = "การเงิน\nจังหวะดวงมีความวุ่นวายหนักหน่วง มีเกณฑ์ความติดขัดทางการเงินเข้ามา การหาเงินหารายได้ในช่วงนี้ค่อน\nข้างยาก  หรืออาจจะได้เงินมาแบบไม่เต็มเม็ดเต็มหน่วย  อีกทั้งยังมีเกณฑ์เสียเงินกับเรื่องที่ไม่จำเป็นอีกด้วย \nเช่น ค่าปรับ ค่าธรรมเนียมต่างๆ สำหรับเรื่องของโชคลาภ ถือว่ายังพอมีเข้ามาบ้าง แต่จะเป็นรูปแบบของฝาก \nของขวัญมากกว่าโชคที่เป็นตัวเงิน\nการงาน\nจังหวะดวงไม่เป็นใจ  มีผลให้พลังใจและพลังกายลดน้อยลง  หมดไฟกับการทำงาน  บางคนมีหลายเรื่องทำให้\nไม่สบายใจ ถูกนินทาใส่ร้ายหรือรู้สึกเบื่อหน่ายกับงานที่ทำอยู่ นอกจากนี้ต้องเตือน!ให้ระวังเรื่องเอกสารสัญญา\nการเจรจาให้มากขึ้นด้วย ช่วงนี้มีโอกาสผิดพลาดได้ง่ายกว่าปกติ แต่ข้อดีของดวง คือ ยังมีคอนเน็กชั่นที่ดี การ\nติดต่อ การขอความช่วยเหลือจากคนรอบข้างอยู่ในเกณฑ์ที่ดีมาก\nความรัก\nอยู่ในเกณฑ์ที่ไม่นิ่ง คนโสดที่กำลังเปิดใจคบหากันอยู่ อีกฝ่ายอาจยังมีความไม่ชัดเจน หรือมีความไม่แน่ใจ\nอยู่บ้าง ลักษณะนี้ต้องใช้เวลาศึกษากันไปยาวๆ สำหรับคนที่มีคู่มีแฟนแล้ว ยังดูแลความสัมพันธ์ของกันและ\nกันได้ดี หรืออาจจะมีเซอร์ไพรสที่ดีต่อกันมากขึ้นต้อนรับปีใหม่"
    elif(b == 8):
        if(a >= 17):
            rasee="ราศีสิงห์"
            rsrs = "การเงิน\nเกณฑ์รายได้ยังมีเข้ามาเรื่อยๆ แบบน้ำซึมบ่อทราย มาทีละเล็กละน้อย ค่อยๆเก็บออมกันไป น่าจะเป็นก้อน\nใหญ่ได้แน่นอน หรือหนี้สินเก่าๆ ที่เคยมีคนมาหยิบยืมไป ช่วงนี้มีโอกาสได้คืนกลับมา และในช่วงนี้ยังมีดวง\nโชคลาภเข้ามาให้ลุ้นพอหอมปากหอมคออีกด้วย\nการงาน\nถือว่าปีใหม่นี้จะเป็นจุดเริ่มต้นของหน้าที่การงานใหม่ ๆ หลายอย่าง  งานบางอย่างกำลังอยู่ในช่วงปรับตัว วาง\nแผนหรือเตรียมความพร้อมอยู่ แต่ดูเหมือนการเริ่มต้นใหม่ในช่วงนี้อาจจะติดขัดอยู่บ้าง มีปัญหาอุปสรรคเข้า\nมาเป็นระยะ  สำหรับคนที่มีร้าน  เจ้าของธุรกิจ ปัญหาสำคัญจะเกี่ยวกับลูกน้องบริวารและมีผลให้เหนื่อยหนัก\nมากขึ้นตามมา แต่เชื่อว่าถ้าผ่านช่วงเดือนนี้ไปแล้ว หลายอย่างจะเบาลงและมีความสำเร็จก้าวหน้าเข้ามาแทนที่\nความรัก\nจังหวะดวงดาวยังไม่นิ่ง มีผลให้คนที่มีคู่มีแฟนแล้วจะมีเรื่องทะเลาะกันได้ง่ายๆ เรื่องเล็กน้อยจะเป็นชนวนให้\nเกิดปัญหาลุกลามบานปลาย  จึงต้องระวัง!ความสัมพันธ์ไว้หน่อย  สำหรับคนโสด  จังหวะดวงยังไม่เหมาะกับ\nการเริ่มต้นใหม่ แนะนำให้ใช้เวลากับเรื่องอื่นๆ ไปก่อน"
        else:
            rasee="ราศีกรกฎ"
            rsrs = "การเงิน\nสถานะการเงินฝืดเคืองต้อนรับปีใหม่ หาเงินหารายได้ค่อนข้างยาก บวกกับยังมีรายจ่ายในหนี้สินต่างๆรออยู่\nหลายอย่าง  ช่วงนี้อยากให้ระวัง!  การถูกหลอกถูกโกงไว้ด้วย  พยายามอย่าไว้ใจใครง่ายๆและระวังการทำ\nสัญญาการทำธุรกรรมอย่างรอบคอบด้วย ในขณะที่ดวงโชคลาภยังไม่โดดเด่น จึงไม่ควรทุ่มเทเงินทองกับ\nการเสี่ยงทุกประเภท\nการงาน\nมีเกณฑ์จะได้รับมอบหมายหลายหน้าที่ มีงานใหม่ๆ เข้ามาให้บริหารจัดการ บางคนยังมีโอกาสได้เปลี่ยนงาน\nใหม่อีกด้วย หรือบางคนจะได้เพื่อนร่วมงานใหม่ๆ เข้ามา ถ้าเป็นเจ้าของร้าน เจ้าของธุรกิจจะมีลูกค้าใหม่ ๆ\nหรือมีหุ้นส่วนใหม่เข้ามาด้วยเช่นกัน  เพียงแต่สิ่งใหม่ ๆ ที่เข้ามานั้นอาจจะมาพร้อมกับความวุ่นวายอยู่บ้าง \nและความเหน็ดเหนื่อยในการทำงานยังมีอยู่ ซึ่งยังไม่ได้หายไปไหน\nความรัก\nจังหวะดวงช่วงนี้ยังไม่เหมาะที่คนโสดจะเปิดใจคบหาใครจริงจัง เพราะลำพังแค่เรื่องงานในช่วงนี้ก็หนักหนา\nสาหัสแล้ว ถ้ามีความรักเข้ามาให้ปวดหัวอีก น่าจะไปไม่รอด หรือบางคู่ที่ลองคบหากันอยู่ อาจจะได้เจอกับ\nนิสัยที่แท้จริงของกันและกัน ทำให้ไปต่อได้ลำบาก ลักษณะนี้ต้องใช้เวลาดูไปก่อน สำหรับคนที่มีคู่มีแฟน\nแล้ว มีเกณฑ์กระทบกระทั่งกันอยู่บ่อย ๆ แต่โดยรวมแล้วยังไม่ร้ายแรง ยังคงมีความสัมพันธ์ที่ดีต่อกัน"
    elif(b == 9):
        if(a >= 17):
            rasee="ราศีกันย์"
            rsrs = "การเงิน\nเริ่มต้นปีกันด้วยข่าวดีที่การเงินกำลังจะพลิกฟื้นดีขึ้น ถึงแม้ยังไม่มีรายได้ใหม่ๆ เข้ามาเป็นกอบเป็นกำ แต่\nปัญหาการเงินจะค่อยๆ  คลี่คลายและมีทางออกที่ดี สำหรับคนที่อยากเสี่ยงโชคในช่วงมกราคมนี้  มีโอกาส\nได้เงินได้ลุ้นเบา ๆ เหมือนกัน  แต่โชคที่โดดเด่นจะเป็นโชคที่มาจากทางไกลหรือมีคนต่างถิ่นนำโชคมาให้\nการงาน\nเดือนนี้เป็นเดือนแห่งการเตรียมตัว ศึกษาหาข้อมูล เพื่อเตรียมรับข่าวดีที่จะเข้ามาในอนาคตอันใกล้ ในช่วง\nปีใหม่นี้ดวงออนไลน์มาแรง!  ลองเปิดใจและลงมือทำดู เชื่อว่าจะส่งเสริมให้ราศีกันย์โดดเด่นในการทำงาน\nมากขึ้น และยังทำให้เกิดเป็นเงินทองรายได้ที่ดีเข้ามามากขึ้นด้วย หรืองานที่เกี่ยวกับต่างประเทศ การติดต่อ\nลูกค้าในพื้นที่ไกล ๆ จะส่งผลที่ดีเช่นกัน\nความรัก\nจังหวะดวงความรักไปได้ดี คนที่มีคู่มีแฟนแล้วยังดูแลความรักความสัมพันธ์ไปได้ตลอดรอดฝั่ง มีความรัก\nความเข้าใจที่ดีต่อกัน สำหรับคนโสด  มีโอกาสจะได้พบกับคนใหม่ ๆ เข้ามาพูดคุยด้วย มีพ่อสื่อแม่สื่อเป็น\nกองเชียร์ให้มีโอกาสได้รู้จักคนใหม่ ๆ และมีโอกาสได้สานต่อเริ่มต้นกันต่อไป"
        else:
            rasee="ราศีสิงห์"
            rsrs = "การเงิน\nเกณฑ์รายได้ยังมีเข้ามาเรื่อยๆ แบบน้ำซึมบ่อทราย มาทีละเล็กละน้อย ค่อยๆเก็บออมกันไป น่าจะเป็นก้อน\nใหญ่ได้แน่นอน หรือหนี้สินเก่าๆ ที่เคยมีคนมาหยิบยืมไป ช่วงนี้มีโอกาสได้คืนกลับมา และในช่วงนี้ยังมีดวง\nโชคลาภเข้ามาให้ลุ้นพอหอมปากหอมคออีกด้วย\nการงาน\nถือว่าปีใหม่นี้จะเป็นจุดเริ่มต้นของหน้าที่การงานใหม่ ๆ หลายอย่าง  งานบางอย่างกำลังอยู่ในช่วงปรับตัว วาง\nแผนหรือเตรียมความพร้อมอยู่ แต่ดูเหมือนการเริ่มต้นใหม่ในช่วงนี้อาจจะติดขัดอยู่บ้าง มีปัญหาอุปสรรคเข้า\nมาเป็นระยะ  สำหรับคนที่มีร้าน  เจ้าของธุรกิจ ปัญหาสำคัญจะเกี่ยวกับลูกน้องบริวารและมีผลให้เหนื่อยหนัก\nมากขึ้นตามมา แต่เชื่อว่าถ้าผ่านช่วงเดือนนี้ไปแล้ว หลายอย่างจะเบาลงและมีความสำเร็จก้าวหน้าเข้ามาแทนที่\nความรัก\nจังหวะดวงดาวยังไม่นิ่ง มีผลให้คนที่มีคู่มีแฟนแล้วจะมีเรื่องทะเลาะกันได้ง่ายๆ เรื่องเล็กน้อยจะเป็นชนวนให้\nเกิดปัญหาลุกลามบานปลาย  จึงต้องระวัง!ความสัมพันธ์ไว้หน่อย  สำหรับคนโสด  จังหวะดวงยังไม่เหมาะกับ\nการเริ่มต้นใหม่ แนะนำให้ใช้เวลากับเรื่องอื่นๆ ไปก่อน"
    elif(b == 10):
        if(a >= 18):
            rasee="ราศีตุลย์"
            rsrs = "การเงิน\nของขวัญประเดิมปีใหม่ทางการเงิน คือ การมีตัวช่วยที่ดี หลายคนประสบปัญหาความติดขัดมาก่อนหน้านี้ แต่\nช่วงนี้จะเริ่มมีตัวช่วยทางการเงินเข้ามาช่วยแก้ไข  แนะนำให้พบกับทางออกที่ดี มีวิธีการหาเงิน สร้างรายได้\nใหม่ ๆ ให้เห็นเป็นรูปเป็นร่างมากขึ้น สำหรับดวงโชคลาภยังพอมีเข้ามา แต่โชคที่โดดเด่นจะเป็นโชคจากการ\nติดต่อ การซื้อขายอสังหาริมทรัพย์ ที่อยู่อาศัย ซึ่งมีโอกาสจะได้ผลกำไร ค่าตอบแทนอย่างเต็มเม็ดเต็มหน่วย\nการงาน\nเริ่มต้นปีด้วยดวงการเจรจาที่โดดเด่น ยิ่งจับงานค้าขาย ติดต่อเจรจาธุรกิจต่างๆ ยิ่งมีโอกาสประสบความสำเร็จ \nเพียงแต่ต้องระวัง!  ความขัดแย้งไว้หน่อย ช่วงนี้มีโอกาสขัดแย้งกับทีมงาน หุ้นส่วนได้ง่ายๆ คงต้องทบทวน\nตรวจสอบรายละเอียดให้ถี่ถ้วน เพื่อป้องกันปัญหาที่อาจตามมา อีกทั้งเรื่องของความเครียด ความกดดันทาง\nด้านจิตใจ ช่วงนี้พยายามอย่าตัดสินใจด้วยความวู่วาม\nความรัก\nจังหวะดวงยังคงดำเนินไปได้ดี คนที่มีคู่มีแฟนแล้วยังมีความสัมพันธ์ที่ดีต่อกัน ดวงดาวช่วยประคับประคอง\nความรักความสัมพันธ์ให้ดำเนินไปได้ตลอดรอดฝั่ง  แ ละช่วงนี้ดวงดาวยังส่งเสริมให้คนโสดมีโอกาสได้เจอ\nความรักครั้งใหม่ๆ จากการช่วยเหลือของเพื่อนฝูง ช่วยแนะนำบอกต่อ หรืออาจจะไปติดต่อธุระการงานแล้ว\nมีโอกาสได้เจอกัน มีลุ้นเป็นความรักครั้งใหม่ได้เช่นกัน"
        else:
            rasee="ราศีกันย์"
            rsrs = "การเงิน\nเริ่มต้นปีกันด้วยข่าวดีที่การเงินกำลังจะพลิกฟื้นดีขึ้น ถึงแม้ยังไม่มีรายได้ใหม่ๆ เข้ามาเป็นกอบเป็นกำ แต่\nปัญหาการเงินจะค่อยๆ  คลี่คลายและมีทางออกที่ดี สำหรับคนที่อยากเสี่ยงโชคในช่วงมกราคมนี้  มีโอกาส\nได้เงินได้ลุ้นเบา ๆ เหมือนกัน  แต่โชคที่โดดเด่นจะเป็นโชคที่มาจากทางไกลหรือมีคนต่างถิ่นนำโชคมาให้\nการงาน\nเดือนนี้เป็นเดือนแห่งการเตรียมตัว ศึกษาหาข้อมูล เพื่อเตรียมรับข่าวดีที่จะเข้ามาในอนาคตอันใกล้ ในช่วง\nปีใหม่นี้ดวงออนไลน์มาแรง!  ลองเปิดใจและลงมือทำดู เชื่อว่าจะส่งเสริมให้ราศีกันย์โดดเด่นในการทำงาน\nมากขึ้น และยังทำให้เกิดเป็นเงินทองรายได้ที่ดีเข้ามามากขึ้นด้วย หรืองานที่เกี่ยวกับต่างประเทศ การติดต่อ\nลูกค้าในพื้นที่ไกล ๆ จะส่งผลที่ดีเช่นกัน\nความรัก\nจังหวะดวงความรักไปได้ดี คนที่มีคู่มีแฟนแล้วยังดูแลความรักความสัมพันธ์ไปได้ตลอดรอดฝั่ง มีความรัก\nความเข้าใจที่ดีต่อกัน สำหรับคนโสด  มีโอกาสจะได้พบกับคนใหม่ ๆ เข้ามาพูดคุยด้วย มีพ่อสื่อแม่สื่อเป็น\nกองเชียร์ให้มีโอกาสได้รู้จักคนใหม่ ๆ และมีโอกาสได้สานต่อเริ่มต้นกันต่อไป"
    elif(b == 11):
        if(a >= 17):
            rasee="ราศีพิจิก"
            rsrs = "การเงิน\nดวงดาวช่วงนี้ส่งเสริมให้ราศีพิจิกหยิบจับสิ่งใดล้วนเป็นเงินเป็นทองไปหมด  รายได้ดีขึ้น  ทั้งงานประจำและ\nงานเสริมพิเศษ ค้าขายก็ดีมีกำไร อีกทั้งยังมีดวงโชคลาภเข้ามาสมทบด้วย มีเกณฑ์ปุบปับรับโชคถูกรางวัล\nได้อะไรเข้ามาแบบฟลุ๊คๆ ไม่คาดฝัน หรือหนี้สินเก่าๆ ก็จะได้คืนกลับมาด้วย  จังหวะดวงเฮงๆ ปังๆ ต้อน\nรับปีใหม่อย่างมาก\nการงาน\nช่วงนี้เป็นจังหวะที่ดีของหน้าที่การงาน ใครที่ตกงาน ว่างงาน มีโอกาสจะได้เริ่มต้นใหม่ๆ แน่นอน ส่วนคนที่\nมีงานทำอยู่แล้วจะได้เริ่มต้นสิ่งใหม่  มีโอกาสเข้ามาท้าทาย  หรือใครที่กำลังเตรียมทำสิ่งใหม่ ๆ  ของตัวเอง\nอยู่ มีแนวโน้มที่จะเริ่มต้นได้อย่างราบรื่น= แต่อาจจะมีอุปสรรคปัญหาเกิดขึ้นบ้างเป็นเรื่องปกติ แต่ลักษณะ\nงานที่เกี่ยวกับออนไลน์ การติดต่อกับคนไกลจะส่งผลที่ดีอย่างมาก ทำแล้วปัง ดังแบบฉุดไม่อยู่แน่นอน\nความรัก\nเป็นสิ่งน่าห่วง กระแสดวงช่วงนี้ต้องระแวดระวังกันถ้วนหน้า เพราะคนโสดมีโอกาสจะได้เจอกับคนมีตำหนิ\nมีเจ้าของแล้ว  มีเรื่องปิดบังอยู่  ดังนั้นถ้ามีใครเข้ามาในช่วงนี้  อย่ารีบร้อนตัดสินใจ รวมถึงคนที่มีคู่มีแฟน\nแล้วมีเกณฑ์ที่ความรักครั้งเก่าจะกลับมา หรือขุดคุ้ยปัญหาเก่า ๆ กลับมาทะเลาะกันอีกครั้ง ต้องระวัง!ความ\nสัมพันธ์ให้มากขึ้น"
        else:
            rasee="ราศีตุลย์"
            rsrs = "การเงิน\nของขวัญประเดิมปีใหม่ทางการเงิน คือ การมีตัวช่วยที่ดี หลายคนประสบปัญหาความติดขัดมาก่อนหน้านี้ แต่\nช่วงนี้จะเริ่มมีตัวช่วยทางการเงินเข้ามาช่วยแก้ไข  แนะนำให้พบกับทางออกที่ดี มีวิธีการหาเงิน สร้างรายได้\nใหม่ ๆ ให้เห็นเป็นรูปเป็นร่างมากขึ้น สำหรับดวงโชคลาภยังพอมีเข้ามา แต่โชคที่โดดเด่นจะเป็นโชคจากการ\nติดต่อ การซื้อขายอสังหาริมทรัพย์ ที่อยู่อาศัย ซึ่งมีโอกาสจะได้ผลกำไร ค่าตอบแทนอย่างเต็มเม็ดเต็มหน่วย\nการงาน\nเริ่มต้นปีด้วยดวงการเจรจาที่โดดเด่น ยิ่งจับงานค้าขาย ติดต่อเจรจาธุรกิจต่างๆ ยิ่งมีโอกาสประสบความสำเร็จ \nเพียงแต่ต้องระวัง!  ความขัดแย้งไว้หน่อย ช่วงนี้มีโอกาสขัดแย้งกับทีมงาน หุ้นส่วนได้ง่ายๆ คงต้องทบทวน\nตรวจสอบรายละเอียดให้ถี่ถ้วน เพื่อป้องกันปัญหาที่อาจตามมา อีกทั้งเรื่องของความเครียด ความกดดันทาง\nด้านจิตใจ ช่วงนี้พยายามอย่าตัดสินใจด้วยความวู่วาม\nความรัก\nจังหวะดวงยังคงดำเนินไปได้ดี คนที่มีคู่มีแฟนแล้วยังมีความสัมพันธ์ที่ดีต่อกัน ดวงดาวช่วยประคับประคอง\nความรักความสัมพันธ์ให้ดำเนินไปได้ตลอดรอดฝั่ง  แ ละช่วงนี้ดวงดาวยังส่งเสริมให้คนโสดมีโอกาสได้เจอ\nความรักครั้งใหม่ๆ จากการช่วยเหลือของเพื่อนฝูง ช่วยแนะนำบอกต่อ หรืออาจจะไปติดต่อธุระการงานแล้ว\nมีโอกาสได้เจอกัน มีลุ้นเป็นความรักครั้งใหม่ได้เช่นกัน"
    elif(b == 12):
        if(a >= 16):
            rasee="ราศีธนู"
            rsrs = "การเงิน\nข่าวดี! การเงินจะเริ่มกลับมาตั้งหลักได้ตั้งแต่ช่วงมกราคมนี้เลย หลังจากที่ชาวราศีธนูมืดแปดด้านกับการเงิน\nที่ติดขัดมานาน ช่วงนี้การเงินจะมีความมั่นคงมากขึ้น ทั้งรายได้ สวัสดิการจะดีขึ้น หรือใครที่ค้าขาย ทำธุรกิจ\nของตัวเองจะมีโอกาสประสบความสำเร็จในเรื่องเงินทอง ค้าขายดีมีกำไรและบางคนอาจจะมีเหลือเก็บออม \nนำไปเคลียร์หนี้สินให้เบาลงได้อีกด้วย\nการงาน\nจังหวะดวงค่อนข้างคึกคัก มีความก้าวหน้ามากขึ้น ปัญหาความวุ่นวายต่างๆ ที่เคยเข้ามาจะคลี่คลายดีขึ้น มี\nโอกาสได้รับความช่วยเหลือจากคนรอบข้างหรือผู้ใหญ่เจ้านายมากขึ้น รวมถึงความช่วยเหลือต่างๆอยู่ใน\nเกณฑ์ที่ดีเช่นกัน นอกจากนี้การทำธุรกิจค้าขายจะมีลูกค้าใหม่ๆ มากขึ้น มีหนทางได้ขยับขยายสินค้าหรือ\nสาขาเพิ่มเติมได้อีกด้วย\nความรัก\nยกให้ราศีธนูเป็นราศีที่มีเสน่ห์มาก มีผลให้คนโสดหลายคนจะได้มีคู่มีแฟนบ้างแล้ว ด้วยดวงดาวแห่งความ\nมีเสน่ห์ที่เข้ามานั้นจะทำให้ความรักโดดเด่น  และมีโอกาสได้เริ่มต้นความสัมพันธ์ครั้งใหม่ ๆ  มีตัวช่วยที่ดี\nทั้งญาติพี่น้องหรือเพื่อนฝูงเป็นกองเชียร์แนะนำคนใหม่ๆ ให้รู้จัก สำหรับคนที่มีคู่มีแฟนแล้ว ยังคงมีความ\nสัมพันธ์ที่ลงตัว เพียงแต่ต้องหาเวลาอยู่ร่วมกันให้มากขึ้น เพื่อกระชับความสัมพันธ์ให้แน่นแฟ้น"
        else:
            rasee="ราศีพิจิก"
            rsrs = "การเงิน\nดวงดาวช่วงนี้ส่งเสริมให้ราศีพิจิกหยิบจับสิ่งใดล้วนเป็นเงินเป็นทองไปหมด  รายได้ดีขึ้น  ทั้งงานประจำและ\nงานเสริมพิเศษ ค้าขายก็ดีมีกำไร อีกทั้งยังมีดวงโชคลาภเข้ามาสมทบด้วย มีเกณฑ์ปุบปับรับโชคถูกรางวัล\nได้อะไรเข้ามาแบบฟลุ๊คๆ ไม่คาดฝัน หรือหนี้สินเก่าๆ ก็จะได้คืนกลับมาด้วย  จังหวะดวงเฮงๆ ปังๆ ต้อน\nรับปีใหม่อย่างมาก\nการงาน\nช่วงนี้เป็นจังหวะที่ดีของหน้าที่การงาน ใครที่ตกงาน ว่างงาน มีโอกาสจะได้เริ่มต้นใหม่ๆ แน่นอน ส่วนคนที่\nมีงานทำอยู่แล้วจะได้เริ่มต้นสิ่งใหม่  มีโอกาสเข้ามาท้าทาย  หรือใครที่กำลังเตรียมทำสิ่งใหม่ ๆ  ของตัวเอง\nอยู่ มีแนวโน้มที่จะเริ่มต้นได้อย่างราบรื่น= แต่อาจจะมีอุปสรรคปัญหาเกิดขึ้นบ้างเป็นเรื่องปกติ แต่ลักษณะ\nงานที่เกี่ยวกับออนไลน์ การติดต่อกับคนไกลจะส่งผลที่ดีอย่างมาก ทำแล้วปัง ดังแบบฉุดไม่อยู่แน่นอน\nความรัก\nเป็นสิ่งน่าห่วง กระแสดวงช่วงนี้ต้องระแวดระวังกันถ้วนหน้า เพราะคนโสดมีโอกาสจะได้เจอกับคนมีตำหนิ\nมีเจ้าของแล้ว  มีเรื่องปิดบังอยู่  ดังนั้นถ้ามีใครเข้ามาในช่วงนี้  อย่ารีบร้อนตัดสินใจ รวมถึงคนที่มีคู่มีแฟน\nแล้วมีเกณฑ์ที่ความรักครั้งเก่าจะกลับมา หรือขุดคุ้ยปัญหาเก่า ๆ กลับมาทะเลาะกันอีกครั้ง ต้องระวัง!ความ\nสัมพันธ์ให้มากขึ้น"
    if blood == "O":
        rsbd = "คนกรุ๊ปเลือด O ก็คล้ายนิสัยของผู้ชายทั่ว ๆ ไปนั่นแหละคือมีความสุขุมรอบคอบ ตัดสินใจด้วยเหตุผล เชื่อมั่น\nสมองมากกว่าหัวใจ  ไม่ชอบเพ้อฝัน  และค่อนข้างไปทางวัตถุนิยมหน่อย  ๆ ดังนั้น คนที่มีเลือดกรุ๊ป O จึงมัก\nเป็นบุคคล ที่มีงานทำเป็นหลักเป็นฐาน  แถมหน้าที่การงาน  ก็มักจะดีเป็นพิเศษซะด้วย  เช่น  เป็นทนายความ \nเป็นผู้ตรวจสอบบัญชี หรืออะไรก็ตามที่มีความมั่นคงมาก ๆ"
    elif blood == "A":
        rsbd = "คนกรุ๊ปเลือด A เป็นคนมีความเชื่อมั่นในตนเอง จึงไม่ค่อยโต้เถียง หรือแสดงความคิดเห็นขัดแย้งกับใคร เพราะ\nเชื่ออยู่เสมอว่าความคิดของตนถูกต้องแล้ว จึงไม่ต้องไปขอความคิดเห็นจากใครอีก ส่วนมากจะเป็นคนเอาใจเก่ง\nเห็นใจและตามใจคนอื่นเสมอ มีข้อเสียอยู่บ้างตรงที่เป็นคนขาดความคิดริเริ่ม หากเป็นชายที่บังเอิญได้หญิงฉลาด\nมาเป็นคู่ ฝ่ายหญิงจะรู้สึกผิดหวังในตัวเขาอยู่บ้าง แต่หากเป็นหญิงแล้วลักษณะเช่นเดียวกันนี้ก็อาจจะเป็นผลดี"
    elif blood == "B":
        rsbd = "คนกรุ๊ปเลือด B นั้น จะเป็นบุคคลที่พร้อมจะหัวเราะได้ทุกเวลา เพราะมีนิสัยร่าเริง รักอิสระเสรี ตามใจตัวเอง \nไม่แคร์ต่อสายตาประชาชี ใครจะหมั่นไส้ ใครจะค้อนก็ช่าง ฉันพอใจเสียอย่าง ใครจะทำไม เพราะฉะนั้น จึง\nชอบทำงานประเภท “วันแมนโชว์” ไม่นิยมเข้าหุ้นกับใคร สามารถเป็นศิลปิน นักประพันธ์ หรือหากจะทำงาน\nในองค์กรใหญ่ โอกาสเป็นผู้บริหารก็มาก เพราะเป็นคนเด็ดเดี่ยวกล้าแสดงความคิดเห็น อย่างไม่หวั่นเกรงผู้ใด"
    elif blood == "AB":
        rsbd = "คนกรุ๊ปเลือด AB เป็นคนแปลก เวลาที่ประสบความสำเร็จ เขาจะผยองลำพอง อวดความสามารถของตนไปทั่ว\nแต่ถ้าพบกับความผิดหวังแม้เพียงน้อยนิด เขาก็จะกลับกลายเป็นคนละคน ปิดประตูลั่นกุญแจ ตีอกชกหัวอยู่คน\nเดียว แม้ใครจะปลอบใยน ก็ไม่ยอมคลายความเศร้าโศก ซึ่งนิสัยประหลาดแบบนี้ แม้แต่เจ้าตัวเองก็ให้คำอธิบาย\nไม่ได้เหมือนกันว่า เพราะเหตุใดกันแน่"
    
    if day == "Mon":
        rsdy = "คนเกิดวันจันทร์ เบื่อการเปลี่ยนแปลง ท้อแท้ต่อปัญหาที่เข้ามาในชีวิตอยู่บ่อยๆ ชอบทำตัวเรื่อยๆ ถ้าจะ\nไม่มีอะไรเข้ามาในชีวิต ก็ไม่ได้อยากขวนขวายหามา ความสุขของคุณเกิดขึ้นง่าย แต่บางทีความทุกข์ก็\nเกิดขึ้นง่ายๆ เช่นกัน"
    elif day == "Tue":
        rsdy = "คนเกิดวันอังคาร เป็นคนที่สามารถปรับตัวได้ดี ต้องการเตรียมความพร้อมก่อนจะเจอสิ่งใดๆ มองโลก\nในแง่ดี มีความเป็นผู้ใหญ่ ชอบให้คำแนะนำหรือสั่งสอนคนอื่นได้ คุณรู้ตัวว่าคำแนะนำนั้นมีประโยชน์"
    elif day == "Wed":
        rsdy = "คนเกิดวันพุธ มีความเข้าใจในธรรมชาติ เข้ากับคนได้ง่าย ขี้เบื่อ เวลาเห็นใครทำอะไรไม่สบอารมณ์ \nจะแสดงออกมาด้วยการกระทำใดการกระทำหนึ่ง ไม่ค่อยชอบเก็บไว้ ใจร้อนและหุนหันเอาการเลย"
    elif day == "Thu":
        rsdy = "คนเกิดวันพฤหัสบดี เป็นคนเย็นๆ เรียบง่ายสบายๆ มีขั้นตอนการวางแผนเตรียมการ ชอบความสงบสุข \nหลีกหนีเรื่องราวเมื่อรู้สึกว่ากำลังจะเกิดปัญหา ด้วยลีลาหลบหลีกขั้นเทพและมีชั้นเชิง"
    elif day == "Fri":
        rsdy = "คนเกิดวันศุกร์ เป็นคนไม่ชอบเหมือนใคร มีลักษณะนิสัยบางอย่างที่โดดเด่น จริงใจ เป็นมิตรที่น่าคบหา \nไม่มีมารยา มีความสุขกับเรื่องแปลกๆ หรืออีกอย่างก็มีความสุขกับเรื่องที่ง่ายดายแบบสุดๆ"
    elif day == "Sat":
        rsdy = "คนเกิดวันเสาร์ เป็นคนเบื่อความจำเจ ชอบหาความแปลกใหม่ให้กับชีวิต ภายนอกที่แสดงออกมาดูเหมือน\nเป็นคนนิ่ง ขรึม ออกแนวเข้มแข็ง แต่ภายในใจแอบซ่อนความอ่อนไหวและความโรแมนติกอย่างลึกล้ำไว้"
    elif day == "Sun":
        rsdy = "คนเกิดวันอาทิตย์ เป็นคนรักสันโดษ มีความสุขและมอบรอยยิ้มให้กับคนรอบข้างได้ในทุกสถานการณ์ \nแม้จะเป็นช่วงที่คุณทุกข์ใจเพียงใด เป็นที่ปรึกษาให้กับเพื่อนฝูงได้ในทุกเรื่อง เป็นคนที่ช่างจดช่างจำ \nมุ่งมั่นและเอาจริงเอาจังกับชีวิต"

def siamee():
    global siame
    global rssm
    if siame == 1:
        rssm = "คำทำนายที่หนึ่ง \nเซียมซีใบนี้ว่าด้วย    ช่วงนี้ชะตาชีวิตเปรียบเหมือน\nแสงพระอาทิตย์อันแรงกล้า ทำการสิ่งใดไม่มีอุปสรรค \nถ้าเจ็บป่วยจะมีหมอดีมารักษา เงินทองไม่ขัดสนการงาน\nก้าวหน้าสรรพสิ่งดีนักแล"
    elif siame == 2:
        rssm = "คำทำนายที่สอง\nเซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ไม่มีอุปสรรค\nจะได้โชคลาภอันพึงประสงค์ การงานเจริญรุ่งเรือง\nถ้าเจ็บป่วยจะมีหมอดีมารักษา เนื้อคู่ยังอยู่ไกลทุก\nอย่างดีนักแล"
    elif siame == 3:
        rssm = "คำทำนายที่สาม\nเซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ อาจมีอุปสรรคอยู่บ้าง\nเล็กน้อย จงไหว้พระขอพรสิ่งร้ายจะกลับกลายเป็นดี ถาม\nเรื่องการงานแลเชื่อเสียงช่วงนี้ยังดีอยู่ โรคภัยไม่มี โชคลาภ\nมีน้อย เนื้อคู่จะช่วยท่านสร้างชื่อเสียงได้"
    elif siame == 4:
        rssm = "คำทำนายที่สี่\nเซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้จะมีโชคลาภ\nการงานรุ่งเรือง ถ้าเจ็บป่วยจะมีหมอดีมารักษา\nครอบครัวและตัวท่านจะประสบสุขตลอดกาลดีนักแล"
    elif siame == 5:
        rssm = "คำทำนายที่ห้า\nเซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ยังไม่ราบรื่น \nการงานมีอุปสรรค ท่านจะเจ็บไข้ได้ป่วยความรัก\nไม่สดชื่น โชคลาภยังไม่มี จงหมั่นไหว้พระ และ\nขอพร วสิ่งร้ายก็จะทุเลาลงบ้าง"
    elif siame == 6:
        rssm = "คำทำนายที่หก\nเซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้จะพบคนที่มี\nบุญมาช่วยเหลือ การงานก้าวหน้า เงินทองคล่องตัว \nความรักจะพบเนื้อคู่ เจ็บป่วยไม่มี ทุกสิ่งทุกอย่าง\nสมประสงค์ดีนักแล"
    elif siame == 7:
        rssm = "คำทำนายที่เจ็ด\nเซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้จะได้ลาภ ผ้าผ่อน\nเงินทอง การงานไม่มีอุปสรรค แลจะได้ที่อยู่กันอันพึงใจ\nความรักสดชื่น เจ็บป่วยจะมีหมอดีมารักษา มิฉะนั้นจะ\nได้รับความสุขอย่างประเสริฐยิ่งแล"
    elif siame == 8:
        rssm = "คำทำนายที่แปด\nเซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้จะมีลาภ การงาน\nจะรุ่งเรือง เจ็บป่วยจะหมายเร็ว เงินทองไหลมาเทมา \nสรรพสิ่งสมดังปรารถนาทุกประการดีนักแล"
    elif siame == 9:
        rssm = "คำทำนายที่เก้า\nเซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้จะได้ยศฐาบรรดาศักดิ์\nและสรรพสิ่งลาภจะบริบูรณ์ด้วยทรัพย์สมบัติ การงาน\nเจริญรุ่งเรือง ไม่มีโรคภัยอันตราย ความรักสมหวัง สรรพสิ่ง\nไม่มีอุปสรรคดีนักแล"
    elif siame == 10:
        rssm = "คำทำนายที่สิบ\nเซียมซีใบนี้ว่าด้วย ชะตาชีวิตในช่วงนี้จะได้รับความเดือด\nร้อนด้วยถ้อยคำอันมิชอบจากผู้อื่น และควรระวังอันตราย\nจากการขับขี่ต่าง ๆ การงานมีอุปสรรคนิดหน่อย โชคลาภ\nยังไม่มี ความรักมีอุปสรรคมาก จงหมั่นไหว้ขอพร สิ่งร้าย\nอาจกลายเป็นดี"
    elif siame == 11:
        rssm = "คำทำนายที่สิบเอ็ด\nเซียมซีใบนี้ว่าด้วย ชะตาชีวิตในช่วงนี้จะเกิดถ้วยความ\nให้เกรงสตรีเป็นศัตรูจงหนัก มิฉะนั้นจะถูกฟ้องหาเพราะ\nชู้เมีย ไม่ควรเดินทางกลางคืน การงานไม่มีอุปสรรค อาจ\nจะเจ็บป่วยเสียงเงินทอง จึงควรไหว้พระให้ท่านคุ้มครอง\nสิ่งต่าง ๆ อาจกลายเป็นดี"
    elif siame == 12:
        rssm = "คำทำนายที่สิบสอง\nเซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะได้ลาภยศบริบูรณ์\nสมประสงค์ ทั้งจะอายุยืนยาว การค้าขายเจริญรุ่งเรือง จะ\nมีเนื้อคู่อันประเสริฐ ทุกสิ่งที่ท่านขอจะสมประสงค์ดีนักแล"
    elif siame == 13:
        rssm = "คำทำนายที่สิบสาม\nเซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะได้คนมีบุญมาอุ้ม\nส่งและคุ้มครอง ถ้าเป็นความจะชนะความ การงานไม่มี\nอุปสรรค เจ็บป่วยจะมีหมอดีมารักษา ความรักเบิกบาน \nถ้าเป็นนักเรียนควรตั้งใจศึกษา อนาคตจะรุ่งเรืองดีนักแล"
    elif siame == 14:
        rssm = "คำทำนายที่สิบสี่\nเซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะอันตรายถึงชีวิต\nท่านควรจะไปไหว้ (แปะกง) และขอพรจากท่านแล้ว\nทุกอย่างจะดีขึ้น การงานไม่มีอุปสรรค ครอบครัว อยู่เย็น\nเป็นสุข ตัวท่านอาจจะเจ็บป่วยได้ในช่วงนี้ จึงหมั่นขอพร\nไหว้พระให้มาก ๆ สิ่งร้ายอาจจะกลายเป็นดี"
    elif siame == 15:
        rssm = "คำทำนายที่สิบห้า\nเซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะได้แก้วแหวน\nเงินทอง สรรพสิ่งสมดังใจหมาย การค้าขายรุ่งเรือง\nถ้าเจ็บป่วยจะมีหมอดีมารักษา เนื้อคู่เป็นผู้มีบุญ ทุก\nสิ่งสมประสงค์ ดีนักแล"
    elif siame == 16:
        rssm = "คำทำนายที่สิบหก\nเซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะได้ลาภ ผ้าผ่อน\nสรรพสิ่งทั้งศัตรูจะคิดร้ายมิได้ การค้าขายไม่มีอุปสรรค\nโรคภัยไม่มี เนื้อคู่นั้นอยู่ไกลเวลานี้ มิฉะนั้นจะมีผู้มีบุญ\nมาคุ้มครองดีนักแล"
    elif siame == 17:
        rssm = "คำทำนายที่สิบเจ็ด\nเซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะได้พึ่งผู้สูงอายุ\nหรือผู้มียศฐาบรรดาศักดิ์ และลาภยศกาล สรรพสิ่ง\nสมประสงค์ การงานก้าวหน้า อายุยืนยาว มิฉะนั้นจะ\nได้คู่ที่มีทรัพย์ดีนักแล"
    elif siame == 18:
        rssm = "คำทำนายที่สิบแปด\nเซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะมีลาภน้อย \nการค้าขายหาผล ๆ บังเกิด จะได้คู่ที่พอใจ ถ้าเจ็บ\nป่วยหายง่าย ถ้าคบผู้ใหญ่จะมีอำนาจ ควรหมั่นไหว้\nพระแล้วท่านจะได้สรรพสิ่งดังใจหมาย"

def horocard():
    global rscd
    global card
    rscard ={
        1 : "เป็นคนที่ไม่เหมือนใครในสังคม ไม่ชอบ กฎเกณฑ์ใดๆ มีอิสระสูงไม่ยึดติดในทุกๆ เรื่อง หมายถึงมีโอกาสใหม่ ๆ และ\nหมายถึงการกระโดดในสิ่งที่ไม่รู้โดยไม่กังวลใจแต่อย่างใด\nการงาน หมายถึงการเริ่มต้นกิจการใหม่ๆหรือหมายถึงการเบื่อๆเรื่องงานอยากไปพักร้อน\nการเงิน ภาวะทางการเงินจะไม่แน่นอนคาดหวังความสม่ำเสมอไม่ได้\nความรัก หมายถึงคนเจ้าชู้และอิสระสูงไม่ชอบให้แฟนมาคุม\nสุขภาพ ระวังเกี่ยวกับระบบความดันโลหิต",
        2 : "เป็นคนที่หัวไวเรียนรู้อะไรได้รวดเร็ว และรักอิสระเหมือน The Fool มักทำอะไรตามอารมณ์ หมายถึงการเริ่มต้น\nใหม่สามารถทำสิ่งที่หวังให้สำเร็จลงได้ และมักสนใจเรื่องของภาษาด้วย\nการงาน เหมาะกับงานที่เกี่ยวข้องกับคนจำนวนมากๆเช่นพิธีกร ดีเจ วีเจ งานการสอนก็ดี เพราะสามารถสื่อให้คน\nเข้าใจได้ง่าย หรือทำงานไม่ตรงกับสายที่เรียนมา\nการเงิน หมายถึง จะมีสภาพการเงินที่ดีขึ้น ส่วนใหญ่ตามที่ดูมา จะไม่ดีมาก แต่ก็ไม่แย่ หากเงินหมดก็สามารถหามาได้ทัน\nความรัก คนรักใหม่และคนรักเก่าจะมาในช่วงที่คุณไม่อยากมีความรักเท่าใดนัก หากแอบชอบใครอยู่อาจไม่สมหวัง\nสุขภาพ ระวังระบบทางเดินหายใจและระบบปลายประสาทอักเสบ",
        3 : "เมื่อได้ไพ่ตัวนี้ปรากฏขึ้น มักเป็นช่วงเวลาที่คุณอึดอัดใจ อยากทราบคำตอบที่แท้จริง ต้องอดทนเปิดใจให้กว้าง \nก่อนจะพบทางที่เหมาะสมและคนที่ใช่\nการงาน ธุรกิจจะดำเนินไปอย่างเชื่องช้าในระยะแรก อาชีพที่เหมาะสมคือศิลปินทุกรูปแบบหรืองานพวกการ\nสืบสวน ก็ได้\nการเงิน คุณจะต้องใช้ความอดทน การเงินจะมาแบบช้าๆ\nความรัก ในท่านชายอาจพบหญิงคนหนึ่งที่มีเสน่ห์น่าลุ่มหลง ในท่านหญิงอาจจะเป็นรักข้างเดียวหรือรักซ้อนก็ได้\nสุขภาพ เนื่องจากไพ่ใบนี้เกี่ยวกับธาตุน้ำ จึงควรระมัดระวังระบบการย่อยอาหาร ไต หรือระบบปัสสาวะ",
        4 : "เมื่อหน้าไพ่เป็นตัวแทนของความรัก ความสวยงาม มีทรัพย์สิน การเกิดของทารก การแต่งงาน กิจกรรมดำเนิน\nไปอย่างราบรื่น\nการงาน ถ้าจะค้าขายก็เหมาะของสวยๆงามๆหรือไม่ก็พวกอิเล็กโทรนิคไปเลย ส่วนงานที่ยังไม่เสร็จตามกำหนดต้องแก้ไข\nการเงิน ได้แน่นอนแต่ช้า การทวงหนี้ไม่โกงแต่คุณได้ช้า หากจะขอความช่วยเหลือก็เป็นเพศหญิงที่ขาวๆรูปร่างอวบๆ ดีกว่า\nความรัก เป็นไพ่ของความสมหวัง อาจลงท้ายด้วยการแต่งงาน หรือหมายถึง การมีเพศสัมพันธ์ที่เกิดจากความรัก การตั้งครรภ์ \nหรือมีการหึงหวงถ้ามีไพ่ 7 ดาบมาประกบติดล่ะก็หึงจนน่ารำคาญเลยเชียว\nสุขภาพ ระวังเกี่ยวกับระบบการสืบพันธุ์เช่นมดลูก",
        5 : "หมายถึง คนที่มีลักษณะเป็นผู้นำ คนที่เดินไปข้างหน้า ไม่ถอยหลัง ทำกิจการงานได้ได้โดยไม่รู้จักเหน็ดเหนื่อย วางแผน\nทำกิจการงานใดก็จะต้องลุยให้สำเร็จไปจนได้\nการงาน หมายถึง บริษัทโครงสร้างองค์กรขนาดใหญ่หรืองานที่เกี่ยวพันกับคนต่างชาติ แต่ลักษณะงานที่ถูกโฉลกจะเกี่ยว\nกับวิทยาศาสตร์ เทคโนโลยีสมัยใหม่ การเมือง ราชการ ถ้ามีการเจรจา แบ่งผลประโยชน์ จะเป็นไปอย่างราบรื่น\nการเงิน ควรระมัดระวังการใช้จ่ายอย่างฟุ่มเฟือยหน้าใหญ่ใจกว้าง เงินจึงมักขาดมือแต่ว่าสามารถหามาได้ทันกัน\nความรัก หมายถึง การพบเนื้อคู่ หรือการคิดถึงคนรัก สำหรับท่านหญิงที่หยิบได้ไพ่ใบนี้ อาจแปลได้สองแบบ\nพบรักกับชายอายุมากกว่าหรือเป็นคนต่างชาติ , อาจจะหมายถึงเราออกไปเข้าสังคมมากขึ้น เจอผู้คนมากขึ้น หรือใช้บริการ\nเว็ปหาคู่ สุขภาพ ก็ให้ระวังที่ศีรษะ มักจะมีอาการปวดหัวได้ง่าย",
        6 : "หมายถึง การจัดโครงสร้างหรือจัดระเบียบใหม่ให้กับชีวิตของตนเอง การมีใจไฝ่เรียนรู้ให้สูงขึ้นไปอีก รวมทั้งมีความ\nสนใจในศาสนาและพิธีกรรมอีกด้วย\n การงาน หมายถึงคุณอาจจะมีปัญหาจุกจิกๆ ในงาน หรือมีคนจุกจิกใส่คุณ อาชีพที่เหมาะสม มักจะรับราชการ แพทย์ ครู\n การเงิน หมายถึง คุณจะวางแผนการเงินใหม่แต่อย่าเคร่งครัดมาก ถ้าหากตบะแตกขึ้นมาเงินเก็บจะพลอดหดหายไปด้วย\n ความรัก หากผู้หญิงเปิดได้ไพ่ใบนี้หมายถึง ได้แต่งงานช้าหรือคู่อายุแก่กว่ามาก และหากได้แต่งก็จะทำพิธีอย่างถูกต้อง\n ตามประเพณี\n สุขภาพ ให้ระมัดระวังระบบการย่อย ท้องอืด ท้องเฟ้อ",
        7 : "หมายถึง ช่วงเวลาที่อยากมีความรัก หรือมีคนเข้ามารัก และหมายถึง การเลือก , จุดเด่นของไพ่อีกอย่างคือ จะมีการ\nเปลี่ยนแปลงเกิดขึ้นอย่างไม่คาดคิดมาก่อน หรือการโยกย้ายถิ่นฐานหรือไปต่างประเทศก็ได้\nการงาน อาจจะได้เปลี่ยนงานใหม่ ได้หุ้นส่วนที่ดีหรือคุณจะมีทางสายใหม่ที่ดีกว่าเดิมให้ทำ\nการเงิน การเงินสามารถหามาได้เรื่อยๆ แบบสบายๆ\nความรัก ไม่ต้องสงสัยเลยว่าคุณกำลังอยู่ในช่วงกำลังมีความรัก อย่าเฉื่อยชาหรือกระตือรือล้นจนเกินไป หากเป็นคนโสด\nก็จะพบรักในเวลาไม่นานนัก\nสุขภาพ ระวังพวกลมในกระเพาะอาหาร การจุกเสียด",
        8 : "เป็นสัญลักษณ์ของการเคลื่อนไหว การท้าทาย และการเอาชนะ แต่ต้องใช้ความพยายามอย่างหนัก ในการฟันฝ่าอุปสรรค\nหากคุณมีจิตใจดีมองโลกในแง่ดี ก็สามารถฝ่าฟันอุปสรรคให้ผ่านพ้นไปได้\nการงาน หมายถึง เหมาะกับงานที่เกี่ยวกับการขนส่งทุกชนิด การเป็น สจ๊วต หรือ แอร์ มักจะได้ไพ่ใบนี้ หรือการจะหมายถึง\nการทำงานกับคนต่างชาติ ต้องใช้ภาษาต่างต่างประเทศก็ได้\nการเงิน หมายถึง ต้องเผชิญปัญหาการเงิน แต่ก็สามารถผ่านพ้นมาได้ ต้องมีการโต้เถียง หรือขัดแย้งกัน จึงจะได้เงินนั้นมา\nความรัก คนโสดคุณอาจพบรักกับคนแปลกหน้า คนที่มีคนรักแล้วอาจมีปัญหาจำเป็นต้องแยกกันสักพักและกลับมาคืนดีกัน\nสุขภาพ มักเกี่ยวกับระบบการย่อยการขับถ่ายไม่ดี",
        9 : "ภาพบนไพ่ซึ่งเป็นรูปผู้หญิงกดปากสิงโต แสดงให้เห็นถึงการควบคุมจิตใจ ไม่ยอมแพ้ต่อสิ่งเลวร้ายต่างๆ ที่เข้ามา\nการงาน คุณอาจจะได้รับรางวัลแห่งความสำเร็จในความเพียร หรืองานเกี่ยวกับการดูแลความงามก็ได้\nการเงิน เงินที่คาดหวังไว้จะได้มา ความยุ่งยากทางการเงินจะได้รับการแก้ไข\nความรัก หมายถึงหากคุณเพิ่งพบใครบางคน เวลาจะเป็นตัวช่วยให้ความรักของคุณมั่นคงขึ้น ในรายที่ไม่มีแฟน \nคุณยังไม่พร้อมที่จะรักใครเนื่องจากยังอาวรณ์กับความหลัง\nสุขภาพ แข็งแรงมาก หรือฟื้นตัวจากการไม่สบาย",
        10 : "เป็นช่วงระยะเวลาที่จะใคร่ครวญ และทบทวนสิ่งต่างๆ ให้ละเอียดถ่องแท้ การค้นหาความหมายของชีวิต ไพ่ใบนี้อาจ\nปรากฏในช่วงระยะเวลาที่กำลังศึกษาต่อ ในระดับที่สูงขึ้น ทั้งการศึกษาจริงๆ หรือการศึกษาด้านจิตวิญญาณ ซึ่งช่วยให้\nมีการเติบโตทางด้านจิตใจอีกด้วย\nการงาน งานที่ทำเหมาะกับโครงการระยะยาว หากถามถึงงานที่ทำอยู่ ก็มักจะได้ดีในภายหลัง ถ้ากล่าวถึงอาชีพ\nเหมาะกับแพทย์ อาจารย์ นักเขียน นักวิชาการ\nการเงิน หมายถึง เงินที่เข้ามาเป็นระลอก มีมากพอที่จะจ่ายลงไป\nความรัก เป็นช่วงเวลาที่อยู่ตามลำพัง รู้สึกเหงา ไม่มีใคร หรือหมายถึงการได้แต่งงานเมื่ออายุมากแล้วและรวมทั้งถ่านไฟ\nเกิดคุขึ้นมาอีก คนรักเก่าอาจกลับเข้ามาสู่ชีวิตคุณอีกครั้งหนึ่ง\nสุขภาพ อาการเหมือนโรคซึมเศร้า",
        11 : "หมายถึง ชีวิตกำลังอยู่ในจุดที่จะมีการเปลี่ยนแปลงในด้านดี คือ มีโชคลาภให้เก็บเกี่ยว กงล้อนี้จะหมุนไปเรื่อย ๆ อย่า\nคาดหวังว่าสิ่งที่ดีจะอยู่ตลอดไป หากปรากฏในพื้นดวง หมายถึง มีมรดกทรัพย์สมบัติ หรือมีโชคจากการซื้อที่ดิน\n การงาน หมายถึง เจ้าชะตายังไม่พอใจกับเรื่องของงานมากนัก อยากจะทำให้ดีกว่าเดิม หมายถึงทำงานเกี่ยวกับด้านบ้าน\n และที่ดินก็ได้\n การเงิน การเงินจะมีพอเข้ามาให้ใช้จ่ายทำให้ไม่กังวลใจมากนัก\n ความรัก หากมีความสัมพันธ์อยู่แล้วหมายถึงการคบกันสบายๆไม่หึงหวงซึ่งกันและกัน และอาจจะมีคนรักเก่ากลับเข้ามา\n ในชีวิตอีกครั้งหนึ่ง ในคนโสด มีแนวโน้มว่า จะได้พบใครสักคนท่ามกลางคนหมู่มาก\n สุขภาพ ระวังโรคในช่องท้อง พวกกระเพาะอาหาร ตับ ไต",
        12 : "หมายถึง การตัดสินใจโดยใช้เหตุและผล หากมีเรื่องต้องฟ้องร้องทางกฎหมายจะได้ชัยชนะ\nการงาน ในการทำงานจะได้รับความยุติธรรมจากคนรอบข้าง เหมาะที่จะทำงานเกี่ยวกับราชการรัฐวิสาหกิจ \nหากมีไพ่ 6 ไม้ขึ้นประกอบจะชัดเจนยิ่งขึ้น งานด้านอื่น เช่น งานบัญชี สถาปนิก\nการเงิน สถานะการเงินเป็นแบบมาเร็วไปเร็ว\nความรัก จากประสบการณ์แล้วหากมีเพศตรงข้ามเข้ามาติดพันและหลงคุณมากๆ ต้องระวังให้มากเค้าจะแค่หลงอยู่\nพักหนึ่งแล้วก็จะจากไป\nสุขภาพ ส่วนใหญ่จะไม่ค่อยเจ็บป่วย",
        13 : "โดยส่วนใหญ่ความหมายหน้าไพ่นี้คือการสูญเสีย ไม่ว่าจะเป็นในแง่ของเงิน งาน หรือความรัก แต่สิ่งที่จะตามมา\nหลักจากนั้น คือจะทำให้เข้าใจชีวิตมากขึ้น\nการงาน หมายถึง เป็นช่วงที่ต้องมีความอดทนกับสภาวะการงานที่ทำอยู่ ธุรกิจที่ทำอยู่ เริ่มส่อเค้าปัญหา ไพ่ใบนี้\nต้องโฉลกกันกับงาน แพทย์ พยาบาล หรือคนทำงานในวงการมายา นักข่าว\nการเงิน จะมีปัญหาด้านการเงิน มีคนจะมาเอาเปรียบด้านการเงิน คนที่มีหนี้สินมักจะได้ไพ่ใบนี้ระวังการค้ำ\nประกันหน่อยก็จะดี\nความรัก หากเป็นคนโสด หมายถึง มีความโหยหาในเรื่องความรัก มีความอ่อนไหว หากเพิ่งเริ่มคบกัน อย่างเพิ่งเทใจ\nสุขภาพ หมายถึงโรคเบาหวาน ในท่านหญิงระวังเกี่ยวกับ มดลูกด้วย",
        14 : "หมายถึง มีการเปลี่ยนแปลงเกิดขึ้น หลังจากสถานการณ์เลวร้ายสิ้นสุดลงไป ในช่วงนี้อาจเกิดความคิดใหม่ๆ มีความ\nรู้สึกเหมือนตายแล้วเกิดใหม่ ควรระวังอย่างมากในการอ่านว่าใครจะเสียชีวิต\nการงาน หมายถึง อาจมีความล้มเหลว ผิดหวัง หุ้นส่วนแตกคอกัน ไพ่ใบนี้เหมาะกับอาชีพ แพทย์ พยาบาล ประกันภัย\nประกันชีวิต ตำรวจ หรือทหาร หรือบริษัทประเภท ก๊าซ น้ำมัน สารเคมี\nการเงิน หมายถึง รายได้ค่อนข้างแย่มาก รายได้ตกลงอย่างเห็นได้ชัด ต้องระวัง เงินหาย ถูกยกเค้า โดนล้วงกระเป๋า\nความรัก หากมีคนรักจะมีปัญหา จนอาจเลิกกันได้ ในคนโสด หมายถึง จะพบกับคนที่น่าหลงใหลอย่างมาก\nสุขภาพ อาจเจ็บป่วยกระทันหัน ป่วยหนักต้องเข้าโรงพยาบาล",
        15 : "เป็นสัญลักษณ์ของการโยกย้าย เปลี่ยนแปลง อดทน ควบคุมตนเอง และแสดงถึงมิตรภาพ การปรองดอง\nการงาน หมายถึง มีโอกาสย้ายงาน หรือออกจากงานค่อนข้างสูง หากเปิดได้ในขณะทำนายภาวะปัจจุบัน มีการเดินทาง\nไปพบปะผู้คน เพื่อเจรจาตกลงทางธุรกิจ\nการเงิน หมายถึง มีการหมุนเงินเยอะมากในช่วงนี้\nความรัก หากกำลังมีปัญหากับคนรักอาจต้องการเลิกรา ที่เลิกก็จะกลับมารักกัน คนโสด เพื่อนแนะนำใครบางคนมาให้\nสุขภาพ การทำงานโดยไม่หยุดพัก ทำให้ร่างกายอ่อนแอ",
        16 : "ความหมายของหน้าไพ่นี้คือ ตกอยู่ในอำนาจของความมัวเมาด้วยความโลภโมโทสัน ความทะยานอยากมีอยากได้\nenjoy ในเรื่องทางเพศ อย่างไม่รู้สึกอับอาย\nการงาน ไพ่ใบนี้จะให้ผลดีกับผู้ที่ทำงานเกี่ยวกับอบายมุขทั้งปวง เช่น เปิดบ่อน ขายเหล้า เบียร์ เปิดผับ บาร์ อาบอบนวด\nเป็นต้น หากเป็นคนทำงานปกติทั่วไป มักจะมีงาน Part time เข้ามา\nการเงิน หมายถึงการทำงานหนักมาก หากทำธุรกิจของตนเอง จะได้กำไรน้อยมาก ไม่สมกับที่ลงแรงทำลงไป\nความรัก หมายถึง จะมีแรงดึงดูดระหว่างกันและกันอย่างมิอาจต้านทานได้ ภายหลังจากความปรารถนาอันแรงกล้า\nผ่านไปแล้ว อาจพบว่าไม่มีอะไรเหมือนกันเลยทำให้ต้องเลิกกันไป\nสุขภาพ มีโอกาสเป็นเกี่ยวกับโรคทางเพศสัมพันธ์",
        17 : "หมายถึง จะเกิดการเปลี่ยนแปลงครั้งใหญ่ ส่วนมากจะเป็นไปในทางที่ไม่ค่อยจะดีนัก อาจมีเหตุการณ์ทำให้คุณ\nเสียความรู้สึก หรือสิ้นศรัทธาในบางคนได้\nการงาน หมายถึง สิ่งที่คิดว่ากำลังไปได้ด้วยดีกลับพังทลายลงอย่างไม่คาดคิด ปัญหามักจะเกิดกะทันหันโดย\nไม่ทันตั้งตัว\nการเงิน จะเกิดการสูญเสียเงิน หรือเสียเงินก้อนโตนับตั้งแต่ที่เคยเสียมา\nความรัก อาจจะอกหัก หรือมีการหย่าร้างเกิดขึ้น หากเป็นคนโสดและมีไพ่ความรักที่ดีใบอื่นประกบอยู่หมายถึง\nจะพบรักกะทันหัน\nสุขภาพ ระวังการเจ็บป่วยแบบกระทันหันหรืออุบัติเหตุ",
        18 : "เป็นหน้าไพ่แห่งความหวัง และความไว้วางใจ หากเจ้าชะตาประสบปัญหาความยุ่งยาก จะสามารถแก้ไข ความทุกข์\nออกไปจากความทรงจำ\nการงาน หมายถึง ต้องการปรับปรุงให้ดีขึ้นต่อไป งานที่เกี่ยวข้องกับความสวยงาม ศิลปะจะดีมาก รวมถึงงานก่อ\nสร้างบ้านเรือน วัสดุก่อสร้าง หรือของตกแต่งบ้านก็ได้\nการเงิน คาดการณ์สิ่งใดเกี่ยวกับการเงินไว้มักจะได้ตามที่คาด\nความรัก หมายถึง ส่วนใหญ่ผู้ที่ได้มักเป็นโสด โดยใช้เวลาส่วนใหญ่กับเพื่อนฝูง\nสุขภาพ เมื่อไพ่ใบนี้ปรากฏมักเป็นข่าวดี มักเป็นการฟื้นตัวจากความเจ็บป่วย",
        19 : "หน้าไพ่นี้ให้ระวังเรื่องของการหลอกลวง การหักหลัง ถ้าได้ไพ่ใบนี้ คุณมักจะตกอยู่ในภาวะวิตกกังวลเครียด ไพ่ใบนี้\nมักจะดีกับคนที่ทำงานเป็นศิลปิน เช่น งานโฆษณา นักดนตรี นักแต่งเพลง นอกจากนี้ยังบอกถึง คนที่ชอบด้าน\nไสยศาสตร์ ศาสตร์ที่ไม่สามารถอธิบายได้ด้วยวิทยาศาสตร์\nการงาน หมายถึง อย่าวู่วาม ต้องควบคุมอารมณ์อย่างมาก อาจมีคนกลั่นแกล้งในงานระมัดระวังปัญหาเกี่ยวกับ\nเอกสารต่างๆ ให้ดี\nการเงิน หมายถึงต้องระมัดระวังอาจถูกโกงเงินหุ้นส่วนเอาเปรียบ ระมัดระวังด้านเอกสารให้ดี\nความรัก หากมีคนรักแล้ว อาจถูกคนรักหลอกลวงอยู่ หากเป็นคนโสด หมายถึง คนกำลังโหยหาความรักอย่างมาก\nสุขภาพ ระวังระบบเลือด น้ำเหลือง และมดลูกไม่ดี",
        20 : "เมื่อไพ่ใบนี้ปรากฎในสถานการณ์ปัจจุบัน เรียกว่าสิ่งต่างๆ ในชีวิตจะดีขึ้นในทุกด้าน และมักจะทำให้คนรอบข้างมีชีวิต\nชีวาตามไปด้วย หมายถึงข่าวดีทุกแบบ การเกิดของเด็กคนหนึ่ง\nการงาน ธุรกิจส่วนตัวจะคล่องตัว การติดต่อการงานกับผู้ใหญ่ จะเป็นไปอย่างราบรื่นแต่ต้อง จะได้งานใหม่หากตกงาน\nการเงิน หากรอข่าวใดอยู่ จะได้รับข่าวดี มักจะมีชื่อเสียงในการทำงานก่อน เงินจึงจะได้รับตามมาภายหลัง\nความรัก หมายถึงจะได้คู่ที่ดี ช่วยส่งเสริมกันและกันให้เจริญรุ่งเรือง หากยังไม่มีคนรักก็จะมีเข้ามา ทำนองว่าช้าแต่ชัวร์\nสุขภาพ โดยส่วนมากแข็งแรง แต่ก็ต้องระวังเรื่องความดันโลหิตไว้บ้างก็จะดี",
        21 : "หน้าไพ่นี้ หมายถึง การเกิดใหม่ จะมีการพัฒนาในการดำเนินการต่างๆ นอกจากนี้ยังหมายถึง การตัดสินใจก็ได้ แสดงว่า\nกำลังตัดสินใจเลือกทำสิ่งใดสิ่งหนึ่ง\nการงาน หากเพิ่งลาออกจากงานก็จะได้งานใหม่ในเวลาไม่นานนัก จากประสบการณ์มักจะได้งานจากเพื่อนฝูงบอกต่อมา\nการเงิน เริ่มมีการเปลี่ยนแปลงในทางที่ดีขึ้น เรื่องการเงิน หากลงทุนอะไรลงไปก็จะได้รับผลตอบแทนค่อนข้างดี\nความรัก จะหมายถึง เป็นเรื่องที่ต้องตัดสินใจ เนื่องจากคนรักเก่าได้หวนกลับมา แต่ถ้าได้ไพ่ใบนี้ประกบ 8 ไม้จะอาการ\nเหมือนกับรักแรกพบเลยล่ะ\nสุขภาพ มักฟื้นตัว แต่ถ้าป่วยก็มักเป็นโรคเดิมที่เคยป่วย",
        22 : "เป็นสัญลักษณ์ของวัฎจักรที่สมบูรณ์แบบในการเรียนรู้ตนเอง ซึ่งจะมีการนำประสบการณ์ที่ผ่านมา ใช้พัฒนาความ\nก้าวหน้าให้แก่ชีวิต อาจแต่งงาน หรือพบงานที่จะเปลี่ยนแปลงไปสู่สิ่งใหม่ๆ ในชีวิต\nการงาน หมายถึงงานที่ทำมานานจะประสบความสำเร็จตามที่หวังโดยเฉพาะในสายงานศิลปะงานพวกนายหน้า\nขายที่ดินก็ดีเช่นกัน\nการเงิน หมายถึง เงินจะมาจากหลายๆ ทาง ส่วนใหญ่ จะมาจากสิ่งที่คุณทำมาแล้วเป็นระยะเวลานาน\nความรัก หากเปิดไพ่ Empress และ The Sun มาประกบคู่กันหมายถึงการมีบุตร\nสุขภาพ สุขภาพแข็งแรง",
        23 : "ไพ่เหรียญนี้ก็มักจะเกี่ยวกับเรื่องของการเงิน อะไรที่เป็นความจริงจัง ไม่เพ้อฝัน เรื่องของเวลาก็เน้นว่านานว่า\nจะได้อะไรมาเรื่องราวเป็นแบบช้าๆ มากกว่า คนกลุ่มเหรียญจะไม่ชอบการเสี่ยง ยึดระเบียบประเพณี หน้าไพ่\nนี้เป็นของกลุ่มธาตุดิน\nการงาน ไพ่ใบนี้ดีสำหรับธุรกิจร้านเครื่องประดับทั้งของจริงและของปลอม\nการเงิน หมายถึง โชคลาภทางการเงิน ลาภลอย\nความรัก มีการแสดงออกให้เห็นอย่างเด่นชัดโดยการหยอกเย้า และสัมผัส",
        24 : "ไพ่เหรียญนี้ก็มักจะเกี่ยวกับเรื่องของการเงิน อะไรที่เป็นความจริงจัง ไม่เพ้อฝัน เรื่องของเวลาก็เน้นว่านานว่า\nจะได้อะไรมาเรื่องราวเป็นแบบช้าๆ มากกว่า คนกลุ่มเหรียญจะไม่ชอบการเสี่ยง ยึดระเบียบประเพณี หน้าไพ่\nนี้เป็นของกลุ่มธาตุดิน\nการงาน เหมาะงานพวกการเงิน บัญชี / งานยุ่งแต่ทำทัน\nการเงิน แสดงถึงการหมุนเงิน ได้มาจ่ายไปให้แต่ยังไม่ลำบากอะไร\nความรัก หมายถึงการไม่ค่อยได้พบกับคนรัก",
        25 : "ไพ่เหรียญนี้ก็มักจะเกี่ยวกับเรื่องของการเงิน อะไรที่เป็นความจริงจัง ไม่เพ้อฝัน เรื่องของเวลาก็เน้นว่านานว่า\nจะได้อะไรมาเรื่องราวเป็นแบบช้าๆ มากกว่า คนกลุ่มเหรียญจะไม่ชอบการเสี่ยง ยึดระเบียบประเพณี หน้าไพ่\nนี้เป็นของกลุ่มธาตุดิน\nการเงินจากงาน ได้รับค่าคอมมิชชั่น หากได้ไพ่ใบนี้มักจะหางานได้ง่าย ไพ่นี้จะเด่นกับบุคคลที่เป็น ช่างฝีมือ ศิลปิน\nความรัก จะมีการเตรียมตัวเพื่อสร้างครอบครัว เช่นการเก็บเงิน เพื่อแต่งงานหรือซื้อบ้านร่วมกัน",
        26 : "ไพ่เหรียญนี้ก็มักจะเกี่ยวกับเรื่องของการเงิน อะไรที่เป็นความจริงจัง ไม่เพ้อฝัน เรื่องของเวลาก็เน้นว่านานว่า\nจะได้อะไรมาเรื่องราวเป็นแบบช้าๆ มากกว่า คนกลุ่มเหรียญจะไม่ชอบการเสี่ยง ยึดระเบียบประเพณี หน้าไพ่\nนี้เป็นของกลุ่มธาตุดิน\nการงาน เบื่อหน่าย แต่ทนทำเพื่อเงิน\nการเงิน หมายถึง การเก็บเงินเก็บทอง ใช้เงินอย่างรอบคอบ ประหยัด\nความรัก มีความระมัดระวังจนกลายเป็นเหตุให้เกิดความระแวง หึงหวง",
        27 : "ไพ่เหรียญนี้ก็มักจะเกี่ยวกับเรื่องของการเงิน อะไรที่เป็นความจริงจัง ไม่เพ้อฝัน เรื่องของเวลาก็เน้นว่านานว่า\nจะได้อะไรมาเรื่องราวเป็นแบบช้าๆ มากกว่า คนกลุ่มเหรียญจะไม่ชอบการเสี่ยง ยึดระเบียบประเพณี หน้าไพ่\nนี้เป็นของกลุ่มธาตุดิน\nการงาน ควรระวังงานที่ทำช่วงนี้ให้ดี อาจหมายถึงมีสิทธิ์ตกงาน\nการเงิน ค่อนข้างกังวลใจเกี่ยวกับเรื่องของทรัพย์สินเงิน\nความรัก หมายถึงการคิดถึงคนรักอย่างมาก",
        28 : "ไพ่เหรียญนี้ก็มักจะเกี่ยวกับเรื่องของการเงิน อะไรที่เป็นความจริงจัง ไม่เพ้อฝัน เรื่องของเวลาก็เน้นว่านานว่า\nจะได้อะไรมาเรื่องราวเป็นแบบช้าๆ มากกว่า คนกลุ่มเหรียญจะไม่ชอบการเสี่ยง ยึดระเบียบประเพณี หน้าไพ่\nนี้เป็นของกลุ่มธาตุดิน\nการงาน ผู้ใหญ่ในงานยังเอ็นดูอยู่\nการเงิน จะมีคนมาขอยืมเงินในเร็วๆ หรืออาจะผ่อนสินค้าอยู่\nความรัก มีการให้และรับอย่างเท่าเทียมกัน",
        29 : "ไพ่เหรียญนี้ก็มักจะเกี่ยวกับเรื่องของการเงิน อะไรที่เป็นความจริงจัง ไม่เพ้อฝัน เรื่องของเวลาก็เน้นว่านานว่า\nจะได้อะไรมาเรื่องราวเป็นแบบช้าๆ มากกว่า คนกลุ่มเหรียญจะไม่ชอบการเสี่ยง ยึดระเบียบประเพณี หน้าไพ่\nนี้เป็นของกลุ่มธาตุดิน\nการงานการทำงานหนักมีรางวัลรออยู่ แต่อารมณ์ในการทำงานจะเฉื่อยๆ\nการเงิน แต่ถ้าในแง่ธุรกิจแสดงว่ามีเงินพอที่จะเริ่มทำธุรกิจส่วนตัวได้แล้ว\nความรัก ความสัมพันธ์แบบเพื่อนอาจพัฒนาให้เป็นคู่รักกันได้",
        30 : "ไพ่เหรียญนี้ก็มักจะเกี่ยวกับเรื่องของการเงิน อะไรที่เป็นความจริงจัง ไม่เพ้อฝัน เรื่องของเวลาก็เน้นว่านานว่า\nจะได้อะไรมาเรื่องราวเป็นแบบช้าๆ มากกว่า คนกลุ่มเหรียญจะไม่ชอบการเสี่ยง ยึดระเบียบประเพณี หน้าไพ่\nนี้เป็นของกลุ่มธาตุดิน\nการงานมีเรื่องที่ต้องเรียนรู้เพิ่มขึ้นอีก\nการเงิน ที่เก็บสะสมมากค่อนข้างดี ถ้าในเรื่องของธุรกิจ หมายถึง เริ่มจะได้กำไร\nความรัก ความสัมพันธ์จะเป็นแบบหลงใหลกันอย่างมาก",
        31 : "ไพ่เหรียญนี้ก็มักจะเกี่ยวกับเรื่องของการเงิน อะไรที่เป็นความจริงจัง ไม่เพ้อฝัน เรื่องของเวลาก็เน้นว่านานว่า\nจะได้อะไรมาเรื่องราวเป็นแบบช้าๆ มากกว่า คนกลุ่มเหรียญจะไม่ชอบการเสี่ยง ยึดระเบียบประเพณี หน้าไพ่\nนี้เป็นของกลุ่มธาตุดิน\nการงาน ได้ตำแหน่งงานดี\nการเงิน ถือเป็นไพ่แห่งเงินทองถ้าผู้หญิงได้ไพ่ใบนี้ อาจแปลว่าได้มรดก มีเกณฑ์ได้บ้านหรือรถ\nความรัก ส่วนใหญ่จะโสด แต่หากมีคนรักก็จะมีความพยายามอย่างหนักเพื่อรักษาความรักเอาไว้",
        32 : "ไพ่เหรียญนี้ก็มักจะเกี่ยวกับเรื่องของการเงิน อะไรที่เป็นความจริงจัง ไม่เพ้อฝัน เรื่องของเวลาก็เน้นว่านานว่า\nจะได้อะไรมาเรื่องราวเป็นแบบช้าๆ มากกว่า คนกลุ่มเหรียญจะไม่ชอบการเสี่ยง ยึดระเบียบประเพณี หน้าไพ่\nนี้เป็นของกลุ่มธาตุดิน\nการงาน เหมาะทำธุรกิจของตัวเอง\nการเงิน เจ้าชะตาจะสามารถทำมาหากินให้ร่ำรวยหรือมีการเงินเข้ามา คนที่ค้าขาย หรือเก็งกำไรที่ดิน \nก็ได้ไพ่ใบนี้เช่นกัน\nความรัก หมายถึงการแต่งงาน",
        33 : "ไพ่เหรียญนี้ก็มักจะเกี่ยวกับเรื่องของการเงิน อะไรที่เป็นความจริงจัง ไม่เพ้อฝัน เรื่องของเวลาก็เน้นว่านานว่า\nจะได้อะไรมาเรื่องราวเป็นแบบช้าๆ มากกว่า คนกลุ่มเหรียญจะไม่ชอบการเสี่ยง ยึดระเบียบประเพณี หน้าไพ่\nนี้เป็นของกลุ่มธาตุดิน\nนิสัยเป็นคนยึดโลกในแง่ความเป็นจริงเป็นหลัก หัวเก่า ไม่ชอบเสี่ยง ชอบเรียนรู้\nการงาน ในเรื่องงานจะมีคนเข้ามาช่วย ทำให้งานผ่านไปอย่างง่ายดาย\nการเงิน เงินจะเข้ามาแบบช้าๆ หรือเพิ่งเริ่มต้นธุรกิจ\nความรัก อย่ารีบร้อน หรือผลีผลามในระยะแรกที่เริ่มจีบ",
        34 : "ไพ่เหรียญนี้ก็มักจะเกี่ยวกับเรื่องของการเงิน อะไรที่เป็นความจริงจัง ไม่เพ้อฝัน เรื่องของเวลาก็เน้นว่านานว่า\nจะได้อะไรมาเรื่องราวเป็นแบบช้าๆ มากกว่า คนกลุ่มเหรียญจะไม่ชอบการเสี่ยง ยึดระเบียบประเพณี หน้าไพ่\nนี้เป็นของกลุ่มธาตุดิน\nเป็นคนสบายๆ ความรับผิดชอบสูงซื่อสัตย์ การเงินการธนาคาร\nการงาน ธุรกิจอาจเป็นไปอย่างช้าๆ\nการเงิน ในช่วงเวลาของการหมุนเงิน\nความรัก ถ้ามีคนรักอยู่แล้ว อาจจะกำลังเบื่อที่ต้องหาเวลามาให้คนรัก",
        35 : "ไพ่เหรียญนี้ก็มักจะเกี่ยวกับเรื่องของการเงิน อะไรที่เป็นความจริงจัง ไม่เพ้อฝัน เรื่องของเวลาก็เน้นว่านานว่า\nจะได้อะไรมาเรื่องราวเป็นแบบช้าๆ มากกว่า คนกลุ่มเหรียญจะไม่ชอบการเสี่ยง ยึดระเบียบประเพณี หน้าไพ่\nนี้เป็นของกลุ่มธาตุดิน\nลักษณะบุคคล เป็นหญิงอายุ 35 ปีขึ้นไป มีน้ำใจ ไม่คดโกง ชอบช่วยเหลือ\nการงาน จะมีมุมมองใหม่ๆ ทำให้สามารถแก้ไขปัญหาได้ง่ายขึ้น\nการเงิน ช่วงนี้เป็นช่วงที่ดีในด้านการเงิน เร่งๆ make money เข้าไว้\nความรัก โอกาสมีคนรักสูงเพราะมีเสน่ห์ในตัว",
        36 : "ไพ่เหรียญนี้ก็มักจะเกี่ยวกับเรื่องของการเงิน อะไรที่เป็นความจริงจัง ไม่เพ้อฝัน เรื่องของเวลาก็เน้นว่านานว่า\nจะได้อะไรมาเรื่องราวเป็นแบบช้าๆ มากกว่า คนกลุ่มเหรียญจะไม่ชอบการเสี่ยง ยึดระเบียบประเพณี หน้าไพ่\nนี้เป็นของกลุ่มธาตุดิน\nลักษณะบุคคล เป็นชายอายุ 35 ปีขึ้นไป ผิวขาว ขยันขันแข็ง รู้จักปรับตัวให้เหมาะสมกับสภาพแวดล้อม \nและเป็นคนที่ไว้วางใจได้ในธุรกิจ\nการงาน อาจจะได้รับงานที่ยากลำบากแต่มีรางวัลใหญ่รออยู่\nการเงิน หยิบจับอะไรก็จะเป็นเงินเป็นทอง ดังนั้นรีบๆขยันๆเข้าเถอะ\nความรัก หมายถึง คนรักไม่ติดต่อกลับมา หรือคนรักคิดว่าตนเองไม่ผิด",
        37 : "ไพ่กลุ่มถ้วย ไพ่เซตนี้จะเป็นกลุ่มธาตุน้ำ มีความสัมพันธ์กับอารมณ์ทุกรูปแบบไม่ว่าจะสุข สนุกสนาน มีความรัก \n หรือแม้ความเศร้าเสียใจ อีกทั้งเรื่องการงานมักเกี่ยวข้องกับการสร้างสรรค์งาน\nหน้าไพ่นี้เป็นไพ่แห่งความสุข เป็นการเริ่มต้นอะไรใหม่ๆ\nการงาน มักเป็นคนที่ทำงานที่เน้นเรื่องการบริการลูกค้าเป็นหลักเช่นงานด้านโรงแรม หรืองานทางด้านศิลปะ \nด้านอสังหาหมายถึงคอนโด หรือตึก\nความรัก หมายถึง จะพบรักครั้งใหม่ การเกิดใหม่ของทารก",
        38 : "ไพ่กลุ่มถ้วย ไพ่เซตนี้จะเป็นกลุ่มธาตุน้ำ มีความสัมพันธ์กับอารมณ์ทุกรูปแบบไม่ว่าจะสุข สนุกสนาน มีความรัก \n หรือแม้ความเศร้าเสียใจ อีกทั้งเรื่องการงานมักเกี่ยวข้องกับการสร้างสรรค์งาน\nเป็นไพ่ที่ดี บ่งบอกถึงความกลมกลืนในทุกด้าน การแลกเปลี่ยนผลประโยชน์แก่กัน การฟื้นคืน\nในเรื่องที่แตกสลายไปแล้ว\nการงาน จะหมายถึง เป็นผู้ประสานงานที่ดีแก่คนอื่น การมีหุ้นส่วนที่ดี\nความรัก ถือว่าเป็นไพ่ความรักที่ดีที่สุด มีความสดชื่นสมหวังคอยอยู่",
        39 : "ไพ่กลุ่มถ้วย ไพ่เซตนี้จะเป็นกลุ่มธาตุน้ำ มีความสัมพันธ์กับอารมณ์ทุกรูปแบบไม่ว่าจะสุข สนุกสนาน มีความรัก \n หรือแม้ความเศร้าเสียใจ อีกทั้งเรื่องการงานมักเกี่ยวข้องกับการสร้างสรรค์งาน\nหน้าไพ่นี้บ่งบอกว่าปัญหาจะได้รับการคลี่คลาย\nการงาน หมายถึงการปรับความเข้าใจกับลูกน้องได้หมายถึงคนที่มีพรสวรรค์ทางศิลปะ\nความรัก เป็นไพ่ความรักที่มีความหมายที่ดี แต่เป็นในช่วงแรกของการคบกันและยังหมายถึง\nการตั้งครรภ์ได้อีกด้วย",
        40 : "ไพ่กลุ่มถ้วย ไพ่เซตนี้จะเป็นกลุ่มธาตุน้ำ มีความสัมพันธ์กับอารมณ์ทุกรูปแบบไม่ว่าจะสุข สนุกสนาน มีความรัก \n หรือแม้ความเศร้าเสียใจ อีกทั้งเรื่องการงานมักเกี่ยวข้องกับการสร้างสรรค์งาน\nหมายถึง เป็นคนเรื่องมาก จู้จี้จุกจิก หาอะไรถูกใจตนเองได้ยาก\nความรัก หมายถึง เป็นคนช่างเลือก จะไม่ได้ดังใจ\nการเงิน จะเริ่มดีขึ้นนิดหน่อย\nการงาน ไม่มีความก้าวหน้าในช่วงนี้ เบื่อหน่ายงาน งานจุกจิกมีรายละเอียดมาก",
        41 : "ไพ่กลุ่มถ้วย ไพ่เซตนี้จะเป็นกลุ่มธาตุน้ำ มีความสัมพันธ์กับอารมณ์ทุกรูปแบบไม่ว่าจะสุข สนุกสนาน มีความรัก \n หรือแม้ความเศร้าเสียใจ อีกทั้งเรื่องการงานมักเกี่ยวข้องกับการสร้างสรรค์งาน\nคนที่ได้ไพ่ห้าถ้วย ส่วนใหญ่นั้นจะมองโลกในแง่ร้าย ซึมเซาอยู่กับความโชคร้ายของตัวเอง\nการเงิน อาจจะมีเงินพิเศษเพิ่มเข้ามา\nการงาน อย่ามัวแต่เศร้าจนมองไม่เห็นโอกาสที่เข้ามา\nความรัก หมายถึงพบคนรักแล้วจะไม่ได้พบกันอีก ห่างๆกันไป",
        42 : "ไพ่กลุ่มถ้วย ไพ่เซตนี้จะเป็นกลุ่มธาตุน้ำ มีความสัมพันธ์กับอารมณ์ทุกรูปแบบไม่ว่าจะสุข สนุกสนาน มีความรัก \n หรือแม้ความเศร้าเสียใจ อีกทั้งเรื่องการงานมักเกี่ยวข้องกับการสร้างสรรค์งาน\nความรักหมายถึงการได้พบหรือได้ข่าวของคนรักเก่าหรือเพื่อนเก่า การรวมญาติ การเข้าใจกัน และการคืนดีกัน\nการงาน หากติดไพ่มหาดเล็กถ้วยก็เหมาะทำกิจการเกี่ยวกับเด็ก\nความรัก การได้ข่าวคนรักเก่า หรือมีแฟนเด็กกว่า",
        43 : "ไพ่กลุ่มถ้วย ไพ่เซตนี้จะเป็นกลุ่มธาตุน้ำ มีความสัมพันธ์กับอารมณ์ทุกรูปแบบไม่ว่าจะสุข สนุกสนาน มีความรัก \n หรือแม้ความเศร้าเสียใจ อีกทั้งเรื่องการงานมักเกี่ยวข้องกับการสร้างสรรค์งาน\nหากไพ่ใบนี้ปรากฏบนพื้นดวง มักเป็นคนเจ้าชู้ ช่างฝัน\nการงาน เหมาะกับงานที่ต้องใช้จินตนาการ เช่นงานโฆษณา งานศิลปะ\nการเงิน ช่วงนี้จะใช้เงินฟุ่มเฟือย หรืออาจให้ระวังถูกหลอกลวง\nความรัก ความสัมพันธ์ในช่วงนี้ จะยังไม่มีความมั่นคงอะไร",
        44 : "ไพ่กลุ่มถ้วย ไพ่เซตนี้จะเป็นกลุ่มธาตุน้ำ มีความสัมพันธ์กับอารมณ์ทุกรูปแบบไม่ว่าจะสุข สนุกสนาน มีความรัก \n หรือแม้ความเศร้าเสียใจ อีกทั้งเรื่องการงานมักเกี่ยวข้องกับการสร้างสรรค์งาน\nมีการเปลี่ยนแปลงเกิดขึ้นแบบค่อยเป็นค่อยไป เพราะไม่พอใจชีวิตในปัจจุบันที่เป็นอยู่\nการงาน อาจจะมีการย้ายงานเกิดขึ้น\nการเงิน อาจจะไม่พอใจในรายได้ในตอนนี้ ทำให้อยากหารายได้เพิ่ม\nความรัก การพลัดพรากจากคนที่รัก อาจมีความเบื่อหน่ายทางโลกจนหันหน้าเข้าหาธรรมะ",
        45 : "ไพ่กลุ่มถ้วย ไพ่เซตนี้จะเป็นกลุ่มธาตุน้ำ มีความสัมพันธ์กับอารมณ์ทุกรูปแบบไม่ว่าจะสุข สนุกสนาน มีความรัก \n หรือแม้ความเศร้าเสียใจ อีกทั้งเรื่องการงานมักเกี่ยวข้องกับการสร้างสรรค์งาน\nสามารถแปลความหมายได้หลากหลาย ขึ้นอยู่กับว่า ปรากฏคู่กับไพ่ใบไหน หากไปประกบกับไพ่ Devil \nหมายถึง เป็นทอม เกย์ ดี้ หากประกบกับไพ่ Star หมายถึง ไม่อยากมีแฟน เป็นโสด\nการงาน เหมาะกับประกอบธุรกิจประเภทร้านของชำ\nการเงิน มีรายได้เข้ามาให้พอกินพอใช้",
        46 : "ไพ่กลุ่มถ้วย ไพ่เซตนี้จะเป็นกลุ่มธาตุน้ำ มีความสัมพันธ์กับอารมณ์ทุกรูปแบบไม่ว่าจะสุข สนุกสนาน มีความรัก \n หรือแม้ความเศร้าเสียใจ อีกทั้งเรื่องการงานมักเกี่ยวข้องกับการสร้างสรรค์งาน\nเป็นไพ่ที่ดีเกี่ยวกับความรัก หมายถึง การได้แต่งงาน มีชีวิตคู่ที่สมบูรณ์ มีครอบครัวที่อบอุ่น ความมั่นคง\nทางจิตใจ และความสุขทางใจ มีความพึงพอใจในวัตถุ สุขภาพแข็งแรง",
        47 : "ไพ่กลุ่มถ้วย ไพ่เซตนี้จะเป็นกลุ่มธาตุน้ำ มีความสัมพันธ์กับอารมณ์ทุกรูปแบบไม่ว่าจะสุข สนุกสนาน มีความรัก \n หรือแม้ความเศร้าเสียใจ อีกทั้งเรื่องการงานมักเกี่ยวข้องกับการสร้างสรรค์งาน\nเป็นไพ่ของจิตใต้สำนึกและภาวะอารมณ์ ลักษณะของบุคคล ที่มีอายุไม่เกิน 25 ปี ผิวขาว \nเป็นคนขี้ใจน้อย อ่อนไหวง่าย เหมาะกับอาชีพที่เกี่ยวข้องกับวงการมายา\nการงานเป็นการทำงานแบบรูทีนที่น่าเบื่อหน่าย การเก็บเงินจะเป็นไปแบบไม่จริงจังนัก\nความรัก จะเป็นแบบค่อยเป็นค่อยไป ถ้าต้องการทราบผลเร็ว เห็นทีจะยาก",
        48 : "ไพ่กลุ่มถ้วย ไพ่เซตนี้จะเป็นกลุ่มธาตุน้ำ มีความสัมพันธ์กับอารมณ์ทุกรูปแบบไม่ว่าจะสุข สนุกสนาน มีความรัก \n หรือแม้ความเศร้าเสียใจ อีกทั้งเรื่องการงานมักเกี่ยวข้องกับการสร้างสรรค์งาน\nลักษณะของบุคคล มีอายุมากกว่า 25-35 ปี ผิวขาวท้วม เป็นคนอารมณ์เปลี่ยนแปลงเร็วตามแต่สถานการณ์\nการงาน เหมาะทำงานที่ต้องใช้จิตนาการ หรือภาวะการงานดูเฉื่อยๆ\nการเงิน มีการเปลี่ยนแปลงที่ดีในเรื่องเงิน\nความรัก คนโสดจะพบความรัก หรือคนรักเก่ากลับมา",
        49 : "ไพ่กลุ่มถ้วย ไพ่เซตนี้จะเป็นกลุ่มธาตุน้ำ มีความสัมพันธ์กับอารมณ์ทุกรูปแบบไม่ว่าจะสุข สนุกสนาน มีความรัก \n หรือแม้ความเศร้าเสียใจ อีกทั้งเรื่องการงานมักเกี่ยวข้องกับการสร้างสรรค์งาน\nลักษณะของบุคคล ผิวขาว อวบหรือท้วม เป็นคนควบคุมความรู้สึกดี\nการงาน เหมาะกับงานที่เป็นความชำนาญเฉพาะตัว\nการเงิน มีพอกินพอใช้เรื่อยๆ\nความรัก จะพบรักกับคนที่อาศัยอยู่ในพื้นที่ไม่ไกลกัน",
        50 : "ไพ่กลุ่มถ้วย ไพ่เซตนี้จะเป็นกลุ่มธาตุน้ำ มีความสัมพันธ์กับอารมณ์ทุกรูปแบบไม่ว่าจะสุข สนุกสนาน มีความรัก \n หรือแม้ความเศร้าเสียใจ อีกทั้งเรื่องการงานมักเกี่ยวข้องกับการสร้างสรรค์งาน\nลักษณะบุคคล ผิวขาว ท้วมล่ำสัน เป็นคนอ่อนไหวง่าย เป็นคนฉลาด จิตใจดี เหมาะกับอาชีพ แพทย์ \nนายหน้า พ่อครัว เจ้าของร้านอาหาร\nการเงิน ระวังเกิดความเข้าใจผิดในเรื่องเงินทอง\nความรัก หมายถึงพบชายคนหนึ่งที่เป็นคนรักคนยากอาจจะเป็นเพราะเค้าผิดหวังในความรักมามากก็ได้",
        51 : "ไพ่ชุดดาบ จะเกี่ยวพันกับธาตุลม , เรื่องราวต่างๆ ผันผวนไม่แน่นอน ลักษณะบุคคลเป็นแบบเด็ดขาด ไม่ยอมคน\nการงาน การฝ่าฟันอุปสรรคที่ประดังเข้ามารอบตัว แต่ก็สามารถเอาชนะและผ่านไปได้\nการเงิน เงินตึงกระทันหัน\nความรัก มักเข้ามาแบบรวดเร็วไม่ทันตั้งตัว ในท่านชายจะพยายามจีบจนกว่าจะสำเร็จ",
        52 : "ไพ่ชุดดาบ จะเกี่ยวพันกับธาตุลม , เรื่องราวต่างๆ ผันผวนไม่แน่นอน ลักษณะบุคคลเป็นแบบเด็ดขาด ไม่ยอมคน\nหมายถึง เป็นช่วงของการตัดสินใจ และมีความหมายไปถึงการสื่อสารทุกชนิดด้วย เช่น โทรศัพท์ Internet Fax\nการงาน อาจหมายถึงการเซ็นสัญญา\nความรัก ในเรื่องคู่ให้ระวังการทะเลาะ ไม่ลงรอยกัน จุกจิกกวนใจกัน",
        53 : "ไพ่ชุดดาบ จะเกี่ยวพันกับธาตุลม , เรื่องราวต่างๆ ผันผวนไม่แน่นอน ลักษณะบุคคลเป็นแบบเด็ดขาด ไม่ยอมคน\nมักมีความหมายในทางไม่ดี เช่น การเจ็บปวด การผ่าตัด ไม่ดีในหลายๆด้าน\nการงาน อาจจะคิดเปลี่ยนงานในปัจจุบัน หรือมีปัญหากับหุ้นส่วน\nการเงิน ระวังสูญเสียเงินแบบไม่คาดคิดมาก่อน\nความรัก จะมีการพลัดพรากจากกัน ไม่ว่าจะเป็นการเลิกรากัน",
        54 : "ไพ่ชุดดาบ จะเกี่ยวพันกับธาตุลม , เรื่องราวต่างๆ ผันผวนไม่แน่นอน ลักษณะบุคคลเป็นแบบเด็ดขาด ไม่ยอมคน\nมีความหมายในการหยุดพัก เป็นภาวะผ่อนคลาย\nการงาน หมายถึง งานยังไม่เดิน กาเจ็บป่วยทำให้งานไม่ก้าวหน้า\nการเงิน การเงินยังพอไปได้อยู่\nความรัก การพักฟื้นหลังจากความสัมพันธ์แตกสลายลงไปแล้ว",
        55 : "ไพ่ชุดดาบ จะเกี่ยวพันกับธาตุลม , เรื่องราวต่างๆ ผันผวนไม่แน่นอน ลักษณะบุคคลเป็นแบบเด็ดขาด ไม่ยอมคน\nเป็นไพ่ที่มีความหมายไม่ดีนัก เช่น ความผิดหวัง ความพ่ายแพ้\nการงาน อาจมีเพื่อนร่วมงานทิ้งงานของเค้าไว้ให้คุณแก้ปัญหาแทน\nการเงิน อาจจะเสียเงอนกระทันหัน\nความรัก ความรับจะพบอุปสรรคผู้ใหญ่ เข้ามาขัดขวาง",
        56 : "ไพ่ชุดดาบ จะเกี่ยวพันกับธาตุลม , เรื่องราวต่างๆ ผันผวนไม่แน่นอน ลักษณะบุคคลเป็นแบบเด็ดขาด ไม่ยอมคน\nหากปรากฏไพ่ใบนี้ในสถานะปัจจุบัน เวลาเป็นตัวช่วยให้ปัญหาที่พบนั้นเบาบางลง\nการงาน เหมาะงานหรือธุรกิจที่เกี่ยวกับน้ำ\nการเงิน เงินมาช้า แต่มาเรื่อย ๆ\nความรัก คนรักมาจากแดนไกล",
        57 : "ไพ่ชุดดาบ จะเกี่ยวพันกับธาตุลม , เรื่องราวต่างๆ ผันผวนไม่แน่นอน ลักษณะบุคคลเป็นแบบเด็ดขาด ไม่ยอมคน\nโดยทั่วไป จะหมายถึง การทำธุรกิจที่ผิดกฎหมาย การลงนามในเอกสารต่างๆตรวจสอบให้รอบคอบก่อน\nการงาน ต้องใช้ความประนีประนอมอย่างสูง\nการเงิน ระวังโดนโกงหรือของมีค่าหาย\nความรัก หมายถึง การมีรักซ้อน หรือเปิดเผยไม่ได้",
        58 : "ไพ่ชุดดาบ จะเกี่ยวพันกับธาตุลม , เรื่องราวต่างๆ ผันผวนไม่แน่นอน ลักษณะบุคคลเป็นแบบเด็ดขาด ไม่ยอมคน\nการงาน หมายถึง ตกอยู่ในสถานการณ์ที่แก้ไขอะไรไม่ได้มากนัก จะมีคนใส่ร้าย\nการเงิน อาจเข้าตาจนได้ ระวังไว้อย่างมาก\nความรัก หมายถึง ต้องการหลีกหนีจากความสัมพันธ์ที่เป็นอยู่",
        59 : "ไพ่ชุดดาบ จะเกี่ยวพันกับธาตุลม , เรื่องราวต่างๆ ผันผวนไม่แน่นอน ลักษณะบุคคลเป็นแบบเด็ดขาด ไม่ยอมคน\nการงาน มีคนนินทาให้เสียหาย\nการเงิน จะหมดไปกับสุขภาพ เนื่องจากไม่สบาย\nความรัก หมายถึง จะจากกันคู่รักในเร็วๆ นี้",
        60 : "ไพ่ชุดดาบ จะเกี่ยวพันกับธาตุลม , เรื่องราวต่างๆ ผันผวนไม่แน่นอน ลักษณะบุคคลเป็นแบบเด็ดขาด ไม่ยอมคน\nหมายถึง แผนการต่างๆ ที่ตั้งไว้ได้ล่มลง\nการงาน ธุรกิจส่อเค้าจะพบปัญหาแน่นอน ให้ระมัดระวังคนหักหลัง\nการเงิน การเงินอาจช็อตหนัก หาคนช่วยเหลือยาก\nความรัก ความสัมพันธ์ได้แตกสลายลง การหย่าร้าง",
        61 : "ไพ่ชุดดาบ จะเกี่ยวพันกับธาตุลม , เรื่องราวต่างๆ ผันผวนไม่แน่นอน ลักษณะบุคคลเป็นแบบเด็ดขาด ไม่ยอมคน\nลักษณะบุคคล ชายหรือหญิง อายุไม่เกิน 25 ปี ผิวคล้ำ พูดจาฉะฉาน เป็นคนเอาการเอางาน\nการงาน มักจะเร่งรีบ ไม่มีอะไรที่เรียบ มีกำไรจากการค้า\nการเงิน อาจจะมีคนช่วยเหลือกระทันหัน\nความรัก หากมีคนรักอยู่ ต้องใช้ความยืดหยุ่นกับคนรักค่อนข้างมาก",
        62 : "ไพ่ชุดดาบ จะเกี่ยวพันกับธาตุลม , เรื่องราวต่างๆ ผันผวนไม่แน่นอน ลักษณะบุคคลเป็นแบบเด็ดขาด ไม่ยอมคน\nลักษณะบุคคล เป็นชาย อายุ 25 ปีขึ้นไป ผิวคล้ำ ล่ำสัน เป็นคนคล่องแคล่ว ใจร้อนแต่จิตใจดี\nการงาน ควรต้องละเอียดรอบคอบมากกว่านี้\nการเงิน และการงานมีการเปลี่ยนแปลงอย่าวางใจ\nความรัก คนรักเอาแต่ใจ",
        63 : "ไพ่ชุดดาบ จะเกี่ยวพันกับธาตุลม , เรื่องราวต่างๆ ผันผวนไม่แน่นอน ลักษณะบุคคลเป็นแบบเด็ดขาด ไม่ยอมคน\nลักษณะบุคคล เป็นหญิง อายุ 35 ปีขึ้นไป ผิวคล้ำหรือขาวจัด แข็งแรง ฉลาด รักแรงเกลียดแรง\nการงาน อาจจะต้องกำจัดคน หรือบางสิ่งออกไปจากสภาพงานที่ทำ การเงิน ได้เงินไม่ตรงตามกำหนด\nความรัก อาจจะต้องแยกจากคนรัก",
        64 : "ไพ่ชุดดาบ จะเกี่ยวพันกับธาตุลม , เรื่องราวต่างๆ ผันผวนไม่แน่นอน ลักษณะบุคคลเป็นแบบเด็ดขาด ไม่ยอมคน\nลักษณะบุคคล หมายถึง ชาย อายุ 35 ปีขึ้นไป ผิวคล้ำ ใบหน้าเคร่งเครียด\nการงาน งานที่ใช้กฎหมาย เช่นทหาร ตำรวจ ทนายความ\nการเงิน จะมีสภาพค่อนข้างตึง แม้ว่าจะหามาได้ แต่ยังไม่พอใช้\nความรัก หมายถึง ยังคาดการณ์ไม่ได้ว่าสมหวัง",
        65 : "ไพ่ชุดไม้ เป็นกลุ่มคนที่จะเกี่ยวกับการทำงานหนัก การกระตือรือล้น และไม่อยู่นิ่ง มักหมายถึงช่วงเวลาที่\nก้าวหน้าเหตุการณ์ต่างเกิดขึ้นรวดเร็ว มักเกี่ยวกันกับธาตุไฟ\nการงาน หมายถึง ได้เลื่อนตำแหน่ง /จะได้งานใหม่ หรือมีคนมาชวนไปทำงานโดยไม่ต้องออกไปหา\nการเงิน พอหมุนยังไม่เดือดร้อนมากนัก\nความรัก หมายถึงรักครั้งใหม่ที่สดชื่น รู้สึกจริงจังอย่างมาก",
        66 : "ไพ่ชุดไม้ เป็นกลุ่มคนที่จะเกี่ยวกับการทำงานหนัก การกระตือรือล้น และไม่อยู่นิ่ง มักหมายถึงช่วงเวลาที่\nก้าวหน้าเหตุการณ์ต่างเกิดขึ้นรวดเร็ว มักเกี่ยวกันกับธาตุไฟ\nเรื่องการงาน มักหมายถึงงานนำเข้าส่งออก,งานที่ปรึกษา ,เลขา, การได้เพื่อนร่วมหุ้นที่ดี ไว้ใจได้\nการเงิน ยังพอหมุนเวียนไปได้\nความรัก จะพบกับชายท่าทางหยิ่ง หรือจะพบกับชายที่เคยแต่งงานมาก่อน",
        67 : "ไพ่ชุดไม้ เป็นกลุ่มคนที่จะเกี่ยวกับการทำงานหนัก การกระตือรือล้น และไม่อยู่นิ่ง มักหมายถึงช่วงเวลาที่\nก้าวหน้าเหตุการณ์ต่างเกิดขึ้นรวดเร็ว มักเกี่ยวกันกับธาตุไฟ\nการงาน จัดเป็นหน้าไพ่ที่ดีในเรื่องงาน การทำงานกับครอบครัวหรือคิดจะทำกิจการของตัวเอง\nการเงิน ยังจัดว่าอยู่ในภาวะที่ยังดีอยู่\nความรัก ต้องพยามยามจีบไปเรื่อย ๆ",
        68 : "ไพ่ชุดไม้ เป็นกลุ่มคนที่จะเกี่ยวกับการทำงานหนัก การกระตือรือล้น และไม่อยู่นิ่ง มักหมายถึงช่วงเวลาที่\nก้าวหน้าเหตุการณ์ต่างเกิดขึ้นรวดเร็ว มักเกี่ยวกันกับธาตุไฟ\nหมายถึงสิ่งที่ทำมานานจะได้รับความสำเร็จแล้ว\nการงาน งานที่ทำประสบผลสำเร็จด้วยดี หรือ ทำธุรกิจส่วนตัวขนาดย่อม\nการเงิน การเงินมั่นคงดี ไม่มีปัญหา\nความรัก จะเป็นความรักที่ราบรื่นสมหวัง การไปเที่ยวด้วยกัน 2คน",
        69 : "ไพ่ชุดไม้ เป็นกลุ่มคนที่จะเกี่ยวกับการทำงานหนัก การกระตือรือล้น และไม่อยู่นิ่ง มักหมายถึงช่วงเวลาที่\nก้าวหน้าเหตุการณ์ต่างเกิดขึ้นรวดเร็ว มักเกี่ยวกันกับธาตุไฟ\nการงาน หมายถึงงานเหนื่อยหนัก มีความขัดแย้งในที่ทำงาน หรือเป็นงาน Free lance ก็ได้ค่ะ\nการเงิน การเงิน ไม่ค่อยคล่องนักต้องระวัง\nความรัก จะมีการทะเลาะเบาะแว้ง เถียงกันจนชิน",
        70 : "ไพ่ชุดไม้ เป็นกลุ่มคนที่จะเกี่ยวกับการทำงานหนัก การกระตือรือล้น และไม่อยู่นิ่ง มักหมายถึงช่วงเวลาที่\nก้าวหน้าเหตุการณ์ต่างเกิดขึ้นรวดเร็ว มักเกี่ยวกันกับธาตุไฟ\nการงาน งานที่ทำมาได้บรรลุความสำเร็จ ด้านอาชีพเหมาะกับคนที่ทำงานราชการหรือรัฐวิสาหกิจ\nการเงิน พอมีพอใช้ หากรอเงินอยู่ก็นานกว่าจะได้\nความรัก มีคนอายุน้อยกว่าให้ความสนใจ",
        71 : "ไพ่ชุดไม้ เป็นกลุ่มคนที่จะเกี่ยวกับการทำงานหนัก การกระตือรือล้น และไม่อยู่นิ่ง มักหมายถึงช่วงเวลาที่\nก้าวหน้าเหตุการณ์ต่างเกิดขึ้นรวดเร็ว มักเกี่ยวกันกับธาตุไฟ\nการงาน การแข่งขันทุกประเภท ทั้งเพื่อนร่วมงานและเวลา ต้องพึ่งตนเอง จึงจะประสบความสำเร็จ\nการเงิน ควรระวังการใช้จ่ายอย่างมาก\nความรัก จะสมหวังเมื่อทำให้คู่ต่อสู้พ่ายแพ้เสียก่อน หรือต้องเลือกเอา ระหว่างงาน หรือความรัก",
        72 : "ไพ่ชุดไม้ เป็นกลุ่มคนที่จะเกี่ยวกับการทำงานหนัก การกระตือรือล้น และไม่อยู่นิ่ง มักหมายถึงช่วงเวลาที่\nก้าวหน้าเหตุการณ์ต่างเกิดขึ้นรวดเร็ว มักเกี่ยวกันกับธาตุไฟ\nการงาน งานมีการก้าวหน้าอย่างมาก / งานประเภทimport-ex port\nการเงิน มีความคล่องตัวดี\nความรัก ความรักของคุณเกิดขึ้นเร็วมาก",
        73 : "ไพ่ชุดไม้ เป็นกลุ่มคนที่จะเกี่ยวกับการทำงานหนัก การกระตือรือล้น และไม่อยู่นิ่ง มักหมายถึงช่วงเวลาที่\nก้าวหน้าเหตุการณ์ต่างเกิดขึ้นรวดเร็ว มักเกี่ยวกันกับธาตุไฟ\nการงาน อยากเปลี่ยนงาน ย้ายงาน\nการเงิน เข้าสู่ภาวะเงินเริ่มตึงได้\nความรัก หากคบอยู่ก็แปลว่ามีความหึงหวงอย่างมาก น่ารำคาญ",
        74 : "ไพ่ชุดไม้ เป็นกลุ่มคนที่จะเกี่ยวกับการทำงานหนัก การกระตือรือล้น และไม่อยู่นิ่ง มักหมายถึงช่วงเวลาที่\nก้าวหน้าเหตุการณ์ต่างเกิดขึ้นรวดเร็ว มักเกี่ยวกันกับธาตุไฟ\nการงาน ทำงานหนัก และเหนื่อย ภาระความรับผิดชอบมากขึ้น\nการเงิน จะรู้สึกว่าได้เงินไม่คุ้มกับที่ลงแรงไป\nความรัก หรือมีความสัมพันธ์ตั้งแต่ 2 คนขึ้นไป",
        75 : "ไพ่ชุดไม้ เป็นกลุ่มคนที่จะเกี่ยวกับการทำงานหนัก การกระตือรือล้น และไม่อยู่นิ่ง มักหมายถึงช่วงเวลาที่\nก้าวหน้าเหตุการณ์ต่างเกิดขึ้นรวดเร็ว มักเกี่ยวกันกับธาตุไฟ\nการงาน ถ้าหากไพ่ใบนี้ติดกับไพ่ King หรือ Knight หมายถึงการได้รับสิ่งที่รอคอยมานาน ไม่ว่า\nจะเป็นเงิน งาน โดยรวมหมายถึง การเริ่มต้นจะทำอะไรใหม่ๆ ด้วยความกระตือรือร้น\nความรัก เพิ่งเริ่มต้นขึ้น ยังต้องเรียนรู้กันอีกมาก",
        76 : "ไพ่ชุดไม้ เป็นกลุ่มคนที่จะเกี่ยวกับการทำงานหนัก การกระตือรือล้น และไม่อยู่นิ่ง มักหมายถึงช่วงเวลาที่\nก้าวหน้าเหตุการณ์ต่างเกิดขึ้นรวดเร็ว มักเกี่ยวกันกับธาตุไฟ\nการงาน การเดินทางด้วยเรื่องของงานการตัดสินใจอย่าใช้อารมณ์\nการเงิน หากรออยู่จะล่าช้าออกไป\nความรัก คุณจะพบกับคนที่คุณรู้สึกคุ้นๆ กัน",
        77 : "ไพ่ชุดไม้ เป็นกลุ่มคนที่จะเกี่ยวกับการทำงานหนัก การกระตือรือล้น และไม่อยู่นิ่ง มักหมายถึงช่วงเวลาที่\nก้าวหน้าเหตุการณ์ต่างเกิดขึ้นรวดเร็ว มักเกี่ยวกันกับธาตุไฟ\nลักษณะเป็นหญิงอายุ 30 ขึ้นไป เป็นคนกล้าแสดงออก อ่อนโยน ซื่อสัตย์ สนุกสนาน มีน้ำใจ\nการงาน งานหนักแต่ยังสนุกที่จะทำ\nการเงิน อาจจะมีค่าใช้จ่ายที่ไม่ได้เตรียมเอาไว้\nความรัก นานกว่าจะพบคนรัก",
        78 : "ไพ่ชุดไม้ เป็นกลุ่มคนที่จะเกี่ยวกับการทำงานหนัก การกระตือรือล้น และไม่อยู่นิ่ง มักหมายถึงช่วงเวลาที่\nก้าวหน้าเหตุการณ์ต่างเกิดขึ้นรวดเร็ว มักเกี่ยวกันกับธาตุไฟ\nความหมาย ลักษณะเป็นผู้ชายวัย 30 ปีขึ้นไป เป็นคนทะเยอทะยานมองโลกในแง่ดี มีความเชื่อมั่นในตนเอง\nการงาน จะมีการปรับปรุงให้ดีขึ้น หรือทำธุรกิจของตนเอง\nการเงิน ได้รับข่าวดีจากเงินที่รออยู่\nความรัก ผู้หญิงจะพบชายที่มีเสน่ห์ อย่างมาก",
    }
    rscd = rscard[card]

def menuu():
    global pro
    global menu
    global home
    global rs
    global ss2
    global pc
    if home == 0:
        pro.destroy()
    elif home == 1:
        rs.destroy()
    elif home == 2:
        ss2.destroy()
    elif home == 3:
        pc.destroy()

    menu = Tk()
    menu.title("Horoscope")
    menu.iconbitmap("horoscope/crystal.ico")
    menu.geometry("500x700+700+100")
    menu.config(bg="#7b00c1")
    bg = PhotoImage(file="horoscope/bgmn.png")
    label = Label(menu,image=bg)
    label.place(x=0, y=0)
    Button(menu,text="ชะตาพื้นฐาน",width=17,font=("charcoal",30), fg="#7b00d9", bg="#ffc600", activebackground="#cb70ff", activeforeground="#ffc600", command=result).place(x=50, y=200)
    Button(menu,text="เซียมซี",width=17,font=("charcoal",30), fg="#7b00d9", bg="#ffc600", activebackground="#cb70ff", activeforeground="#ffc600", command=siamese1).place(x=50, y=350)
    Button(menu,text="Pick a card",width=17,font=("charcoal",30), fg="#7b00d9", bg="#ffc600", activebackground="#cb70ff", activeforeground="#ffc600", command=choosecard).place(x=50, y=500)
    menu.mainloop()

def proo():
    global main
    global pro
    global name
    global sname
    global blood
    global dayn
    global month
    global year
    global rasee
    global day
    global tn
    global ts 
    global clicked
    global clicked1
    global clicked2
    global clicked3
    main.destroy()
    pro = Tk()
    pro.title("Horoscope")
    pro.iconbitmap("horoscope/crystal.ico")
    pro.geometry("500x700+700+100")
    pro.config(bg="#7b00c1")
    pro.option_add("*Font", "charcoal 16")
    bg = PhotoImage(file="horoscope/pro.png")
    # label = Label(pro,image=bg)
    # label.place(x=0, y=0)
    Label(pro, image=bg, borderwidth=0,bg="#7b00c1").pack()
    Button(pro,text = "OK",).pack(ipady=550)
    tn = StringVar()
    textname = Entry(pro,textvariable=tn, width= 9,font=("charcoal",21)).place(x = 70,y = 245)
    ts = StringVar()
    textsname = Entry(pro, textvariable=ts, width= 9,font=("charcoal",21)).place(x = 320,y = 245)
    bloods = ["AB","A","B","O"]
    clicked = StringVar()
    clicked.set(bloods[0])
    textblood = OptionMenu(pro,clicked,*bloods).place(x = 222,y = 530)
    days = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31]
    clicked1 = IntVar()
    clicked1.set(days[0])
    textday = OptionMenu(pro,clicked1,*days).place(x = 80,y = 380)    
    months = ["January","February","March","April","May","June","July","August","September","October","November","December "]
    clicked2 = StringVar()
    clicked2.set(months[0])
    textmonth = OptionMenu(pro,clicked2,*months).place(x = 210,y = 380)
    years = [2020,2021,2019,2018,2017,2016,2015,2014,2013,2012,2011,2010,2009,2008,2007,2006,2005,2004,2003,2002,2001,2000,1999,1998,1997,1996,1995,1994,1993,1992,1991,1990,1989,1988,1987,1986,1985,1984,1983,1982,1981,1980,1979,1978,1977,1976,1975,1974,1973,1972,1971]
    clicked3 = IntVar()
    clicked3.set(years[21])
    textyear = OptionMenu(pro,clicked3,*years).place(x = 380,y = 380)
    Button(pro,text="ตกลง",width=6,font=("charcoal",30), fg="#7b00d9", bg="#ffc600", activebackground="#cb70ff", activeforeground="#ffc600", command=data,).place(x=180,y=580)
    pro.mainloop()

def data():
    global pro
    global name
    global blood
    global dayn
    global day
    global month
    global monthn
    global yearn
    global rasee
    global age
    global tn
    global ts 
    global clicked
    global clicked1
    global clicked2
    global clicked3
    global dayth
    global monthth
    name = tn.get()+" "+ts.get()
    blood = clicked.get()
    dayn = clicked1.get()
    month = clicked2.get()
    yearn = clicked3.get()
    a = ["","January","February","March","April","May","June","July","August","September","October","November","December "]
    mmm = {
        "January":"มกราคม",
        "February":"กุมภาพันธ์",
        "March":"มีนาคม",
        "April":"เมษายน",
        "May":"พฤษภาคม",
        "June":"มิถุนายน",
        "July":"กรกฎาคม",
        "August":"สิงหาคม",
        "September":"กันยายน",
        "October":"ตุลาคม",
        "November":"พฤศจิกายน",
        "December ":"ธันวาคม"
    }
    ddd = {
        "Mon":"จันทร์",
        "Tue":"อังคาร",
        "Wed":"พุธ",
        "Thu":"พฤหัสบดี",
        "Fri":"ศุกร์",
        "Sat":"เสาร์",
        "Sun":"อาทิตย์"
    }
    monthn = a.index(month)
    monthth = mmm[month]
    day=str(datetime(yearn, monthn, dayn, 10, 0, 0).ctime())[0:3]
    dayth=ddd[day]
    zodiac()
    menuu()

def siamese1():
    global menu
    global ss1
    menu.destroy() 
    ss1 = Tk()
    ss1.title("Horoscope")
    ss1.option_add("*Font", "Prompt 8")
    ss1.iconbitmap("horoscope/crystal.ico")
    ss1.geometry("500x700+700+100")
    ss1.config(bg="#7b00c1")
    bg = PhotoImage(file="horoscope/bgss.png")
    label = Label(ss1,image=bg)
    label.place(x=0, y=0)
    bg1 = PhotoImage(file="horoscope/bx.png")

    Button(ss1, image=bg1, borderwidth=0,bg="#d4abeb", activebackground="#d4abeb",command=siamese2).place(x=130,y=160)
    Label(ss1, text="- Click the siamese -",font=("charcoal", 13),bg="#7b00c1",fg="#ffc600").place(x=170,y=630)
    ss1.mainloop()

def siamese2():
    global ss2
    global ss1
    global siame 
    global rssm
    global home
    
    siame = random.randint(1,19)
    siamee()
    ss1.destroy() 
    ss2 = Tk()
    ss2.title("Horoscope")
    ss2.option_add("*Font", "Prompt 8")
    ss2.iconbitmap("horoscope/crystal.ico")
    ss2.geometry("500x700+700+100")
    ss2.config(bg="#7b00c1")
    bg = PhotoImage(file="horoscope/asd.png")
    label = Label(ss2,image=bg)
    label.place(x=0, y=-3)

    Label(ss2, text="เซียมซี" ,font=("Prompt", 28),bg="#7b00c1",fg="white").pack(ipady=17)
    Label(ss2, text="ใบที่ "+str(siame),font=("charcoal", 100),bg="white",fg="black").pack(ipady=20)
    Label(ss2, text=rssm,font=("Prompt", 12),bg="white",fg="black").pack(ipady=30)
    home = 2
    Button(ss2,text="เมนู",width=6,font=("charcoal",24), fg="#7b00d9", bg="#ffc600", activebackground="#cb70ff", activeforeground="#ffc600", command=menuu,).place(x=60,y=600)
    Button(ss2,text="เริ่มใหม่",width=6,font=("charcoal",24), fg="#7b00d9", bg="#ffc600", activebackground="#cb70ff", activeforeground="#ffc600", command=homy,).place(x=320,y=600)

    ss2.mainloop()

def result():
    global menu 
    global rs
    global name
    global blood
    global dayn
    global day
    global month
    global monthn
    global yearn
    global rasee
    global rsrs
    global rsbd
    global rsdy
    global age
    global home
    global dayth
    global monthth
    menu.destroy()    
    rs = Tk()
    rs.title("Horoscope")
    rs.option_add("*Font", "Prompt 8")
    rs.iconbitmap("horoscope/crystal.ico")
    rs.geometry("500x700+700+100")
    rs.config(bg="#7b00c1")
    bg = PhotoImage(file="horoscope/gfh.png")
    Label(rs, text="ทำนาย",font=("charcoal", 100),bg="#7b00c1",fg="#ffc000").pack(ipady=0)
    b1 = name+" อายุ "+str(age)+" กรุ๊ปเลือด "+blood
    Label(rs, text=b1,width=100,font=("Prompt", 13) ).pack(ipady=0)
    b2 = "เกิดเมื่อวัน",dayth,"ที่",dayn,"เดือน",monthth,yearn,rasee
    Label(rs, text=b2,width=100,font=("Prompt", 13) ).pack(ipady=0)
    b3 = rsrs
    Label(rs, text=b3,width=100 ).pack(ipady=0)
    b4 = rsdy
    Label(rs, text=b4,width=100 ).pack(ipady=5)
    b5 = rsbd
    Label(rs, text=b5,width=100 ).pack(ipady=10)
    home = 1
    Button(rs,text="เมนู",width=6,font=("charcoal",24), fg="#7b00d9", bg="#ffc600", activebackground="#cb70ff", activeforeground="#ffc600", command=menuu,).place(x=60,y=630)
    Button(rs,text="เริ่มใหม่",width=6,font=("charcoal",24), fg="#7b00d9", bg="#ffc600", activebackground="#cb70ff", activeforeground="#ffc600", command=homy,).place(x=320,y=630)

    rs.mainloop

def homy():
    global home
    global rs
    global main
    global ss2
    global pc
    if home == 1:
        rs.destroy()
    elif home == 2:
        ss2.destroy()
    elif home == 3:
        pc.destroy()
    home=0
    main = Tk()
    main.title("Horoscope")
    main.iconbitmap("horoscope/crystal.ico")
    main.geometry("500x700+700+100")
    main.config(bg="#7b00c1")
    bg = PhotoImage(file="horoscope/bg1.png")
    canva1 = Canvas(main, width=1000, height=5000)
    canva1.pack(fill="both", expand=True)
    canva1.create_image(0,0, image=bg, anchor="nw")
    bt1 = Button(main,text="เริ่มต้น",width=6,font=("charcoal",30), fg="#7b00d9", bg="#ffc600", activebackground="#cb70ff", activeforeground="#ffc600", command=proo,)
    bt1_wd = canva1.create_window(185,530,anchor="nw",window=bt1)
    main.mainloop()

def choosecard():
    global menu
    global cc
    menu.destroy() 
    cc = Tk()
    cc.title("Horoscope")
    cc.option_add("*Font", "Prompt 8")
    cc.iconbitmap("horoscope/crystal.ico")
    cc.geometry("500x700+700+100")
    cc.config(bg="#7b00c1")
    Label(cc, text="Pick a card",font=("Prompt", 50),bg="#7b00c1",fg="White").pack(ipady=40)
    bg1 = PhotoImage(file="horoscope/1.png")
    Button(cc, image=bg1, borderwidth=0,bg="#d4abeb", activebackground="#d4abeb",command=pickcard).place(x=70,y=160)
    bg2 = PhotoImage(file="horoscope/2.png")
    Button(cc, image=bg2, borderwidth=0,bg="#d4abeb", activebackground="#d4abeb",command=pickcard).place(x=300,y=160)
    bg3 = PhotoImage(file="horoscope/3.png")
    Button(cc, image=bg3, borderwidth=0,bg="#d4abeb", activebackground="#d4abeb",command=pickcard).place(x=70,y=420)
    bg4 = PhotoImage(file="horoscope/4.png")
    Button(cc, image=bg4, borderwidth=0,bg="#d4abeb", activebackground="#d4abeb",command=pickcard).place(x=300,y=420)

    cc.mainloop()


def pickcard():
    global cc
    global pc
    global card
    global rscd
    global home
    card = random.randint(1,79)
    horocard()
    cc.destroy() 
    pc = Tk()
    pc.title("Horoscope")
    pc.option_add("*Font", "Prompt 7")
    pc.iconbitmap("horoscope/crystal.ico")
    pc.geometry("500x700+700+100")
    pc.config(bg="#7b00c1")
    bng = "horoscope/card/card("+str(card)+").png"
    bg = PhotoImage(file=bng)
    Label(pc, text="|",font=("Prompt", 68),bg="#7b00c1",fg="#ffc000").pack(ipady=0)
    Label(pc,image=bg, bg="#7b00c1").pack(ipady=10)
    Label(pc,text=rscd,font=("Prompt",8),width=100).pack(ipady=20)
    Label(pc, text="Card",font=("Prompt", 75),bg="#7b00c1",fg="White").place(x=125,y=0)
    home = 3
    Button(pc,text="เมนู",width=6,font=("charcoal",24), fg="#7b00d9", bg="#ffc600", activebackground="#cb70ff", activeforeground="#ffc600", command=menuu,).place(x=60,y=630)
    Button(pc,text="เริ่มใหม่",width=6,font=("charcoal",24), fg="#7b00d9", bg="#ffc600", activebackground="#cb70ff", activeforeground="#ffc600", command=homy,).place(x=320,y=630)
    pc.mainloop()


main = Tk()
main.title("Horoscope")
main.iconbitmap("horoscope/crystal.ico")
main.geometry("500x700+700+100")
main.config(bg="#7b00c1")
bg = PhotoImage(file="horoscope/bg1.png")
canva1 = Canvas(main, width=1000, height=5000)
canva1.pack(fill="both", expand=True)
canva1.create_image(0,0, image=bg, anchor="nw")
bt1 = Button(main,text="เริ่มต้น",width=6,font=("charcoal",30), fg="#7b00d9", bg="#ffc600", activebackground="#cb70ff", activeforeground="#ffc600", command=proo,)
bt1_wd = canva1.create_window(185,530,anchor="nw",window=bt1)
main.mainloop()